#pragma once

// Name: ins, Version: 1805


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Enums
//---------------------------------------------------------------------------

// Enum Insurgency.EProfileBlockType
enum class EProfileBlockType : uint8_t
{
	Controls                       = 0,
	Theater                        = 1,
	Cosmetics                      = 2,
	ServerBrowser                  = 3,
	Highlights                     = 4,
	UserInterface                  = 5,
	Uncategorized                  = 6,
	Replays                        = 7,
	UserSettings                   = 8,
	ConsoleSaveGame                = 9,
	Achievements                   = 10,
	None                           = 11,
	MAX                            = 12,

};

// Enum Insurgency.EConfirmableEvent
enum class EConfirmableEvent : uint8_t
{
	ViewedVersusInfo               = 0,
	ViewedCoopInfo                 = 1,
	ViewedCompInfo                 = 2,
	TutorialHasLaunched            = 3,
	TutorialLeftSpawn              = 4,
	TutorialCompleted              = 5,
	ViewedWeightInfo               = 6,
	ViewedSupplyInfo               = 7,
	ViewedClassInfo                = 8,
	MAX                            = 9,

};

// Enum Insurgency.eInputIconType
enum class EeInputIconType : uint8_t
{
	eInputIconType__Keyboard       = 0,
	eInputIconType__PS4            = 1,
	eInputIconType__XboxOne        = 2,
	eInputIconType__eInputIconType_MAX = 3,

};

// Enum Insurgency.ESoldierStance
enum class ESoldierStance : uint8_t
{
	Stand                          = 0,
	Crouch                         = 1,
	Prone                          = 2,
	Vehicle                        = 3,
	Swim                           = 4,
	Climb                          = 5,
	MAX                            = 6,

};

// Enum Insurgency.EIngameMenuType
enum class EIngameMenuType : uint8_t
{
	Menu_Game                      = 0,
	Menu_Loadout                   = 1,
	Menu_TeamSelect                = 2,
	Menu_TutorialLessons           = 3,
	Menu_CosmeticSelect            = 4,
	Menu_MAX                       = 5,

};

// Enum Insurgency.EFireSupportRequestResult
enum class EFireSupportRequestResult : uint8_t
{
	Success                        = 0,
	SupportCooldown                = 1,
	PersonalCooldown               = 2,
	OutOfBounds                    = 3,
	NoAmmo                         = 4,
	NoRadio                        = 5,
	NotOfficer                     = 6,
	NullPointer                    = 7,
	GameModeBan                    = 8,
	CalledOnClient                 = 9,
	Count                          = 10,
	MAX                            = 11,

};

// Enum Insurgency.EMapVoteSelection
enum class EMapVoteSelection : uint8_t
{
	Map1                           = 0,
	Map2                           = 1,
	Map3                           = 2,
	Map4                           = 3,
	Map5                           = 4,
	Map6                           = 5,
	MaxMapIndex                    = 6,
	Invalid                        = 7,
	Refresh                        = 8,
	PlayAgain                      = 9,
	Random                         = 10,
	MAX                            = 11,

};

// Enum Insurgency.EPendingMenuAction
enum class EPendingMenuAction : uint8_t
{
	None                           = 0,
	TeamSelect                     = 1,
	ClassSelect                    = 2,
	KitSelect                      = 3,
	MAX                            = 4,

};

// Enum Insurgency.EMusicRoundState
enum class EMusicRoundState : uint8_t
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	MAX                            = 3,

};

// Enum Insurgency.ERadialMenuDirection
enum class ERadialMenuDirection : uint8_t
{
	Radial_North                   = 0,
	Radial_NorthEast               = 1,
	Radial_East                    = 2,
	Radial_SouthEast               = 3,
	Radial_South                   = 4,
	Radial_SouthWest               = 5,
	Radial_West                    = 6,
	Radial_NorthWest               = 7,
	Radial_Center                  = 8,
	Radial_MAX                     = 9,

};

// Enum Insurgency.EIngameMenuEntryState
enum class EIngameMenuEntryState : uint8_t
{
	LoadingScreen                  = 0,
	GameSection                    = 1,
	ClassSection                   = 2,
	LoadoutSection                 = 3,
	Ingame                         = 4,
	MAX                            = 5,

};

// Enum Insurgency.EFirearmFiremode
enum class EFirearmFiremode : uint8_t
{
	Safety                         = 0,
	Automatic                      = 1,
	Burst                          = 2,
	Single                         = 3,
	BoltAction                     = 4,
	PumpAction                     = 5,
	Count                          = 6,
	MAX                            = 7,

};

// Enum Insurgency.EGamepadSensitivityCurve
enum class EGamepadSensitivityCurve : uint8_t
{
	Exponential                    = 0,
	Linear                         = 1,
	Dynamic                        = 2,
	DualZone                       = 3,
	MAX                            = 4,

};

// Enum Insurgency.EOpticZoomLevel
enum class EOpticZoomLevel : uint8_t
{
	OneX                           = 0,
	OneHalfX                       = 1,
	TwoX                           = 2,
	TwoHalfX                       = 3,
	ThreeX                         = 4,
	FourX                          = 5,
	SixX                           = 6,
	SevenX                         = 7,
	MAX                            = 8,

};

// Enum Insurgency.EPlaylistType
enum class EPlaylistType : uint8_t
{
	PVP                            = 0,
	Coop                           = 1,
	Competitive                    = 2,
	MAX                            = 3,

};

// Enum Insurgency.EServerBrowserLightingSelection
enum class EServerBrowserLightingSelection : uint8_t
{
	Day                            = 0,
	Night                          = 1,
	DayAndNight                    = 2,
	MAX                            = 3,

};

// Enum Insurgency.EServerBrowserFilterSelection
enum class EServerBrowserFilterSelection : uint8_t
{
	NoPreference                   = 0,
	Include                        = 1,
	Exclude                        = 2,
	MAX                            = 3,

};

// Enum Insurgency.ECosmeticIngameEquipState
enum class ECosmeticIngameEquipState : uint8_t
{
	NeverEquip                     = 0,
	AlwaysEquip                    = 1,
	ItemDependentEquip             = 2,
	Count                          = 3,
	MAX                            = 4,

};

// Enum Insurgency.ECosmeticMenuEquipState
enum class ECosmeticMenuEquipState : uint8_t
{
	NotEquipped                    = 0,
	EquippedPreferredFaction       = 1,
	EquippedOtherFaction           = 2,
	Count                          = 3,
	MAX                            = 4,

};

// Enum Insurgency.EPurchaseResult
enum class EPurchaseResult : uint8_t
{
	Success                        = 0,
	Invalid                        = 1,
	Conflict                       = 2,
	NotAvailable                   = 3,
	TooExpensive                   = 4,
	Overweight                     = 5,
	EquipLimit                     = 6,
	SubSlotNotAllowed              = 7,
	Locked                         = 8,
	MAX                            = 9,

};

// Enum Insurgency.ERefundResult
enum class ERefundResult : uint8_t
{
	Success                        = 0,
	Invalid                        = 1,
	Locked                         = 2,
	MAX                            = 3,

};

// Enum Insurgency.EFirearmCategory
enum class EFirearmCategory : uint8_t
{
	AssaultRifle                   = 0,
	LightMachineGun                = 1,
	BoltRifle                      = 2,
	MarksmanRifle                  = 3,
	Carbine                        = 4,
	Shotgun                        = 5,
	SubmachineGun                  = 6,
	Pistol                         = 7,
	Launcher                       = 8,
	HeavyMachineGun                = 9,
	Count                          = 10,
	MAX                            = 11,

};

// Enum Insurgency.EOutpostWaveType
enum class EOutpostWaveType : uint8_t
{
	Normal                         = 0,
	Special                        = 1,
	Final                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.ESurvivalWaveType
enum class ESurvivalWaveType : uint8_t
{
	Normal                         = 0,
	Special                        = 1,
	Final                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EItemGearLevel
enum class EItemGearLevel : uint8_t
{
	None                           = 0,
	Light                          = 1,
	Heavy                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EInteractableGearType
enum class EInteractableGearType : uint8_t
{
	None                           = 0,
	GogglesNightVision             = 1,
	GogglesGasMask                 = 2,
	MAX                            = 3,

};

// Enum Insurgency.ERoundResetBehavior
enum class ERoundResetBehavior : uint8_t
{
	Remove                         = 0,
	Reset                          = 1,
	Custom                         = 2,
	MAX                            = 3,

};

// Enum Insurgency.ECallVoteResult
enum class ECallVoteResult : uint8_t
{
	CallAcknowledged               = 0,
	Started                        = 1,
	Queued                         = 2,
	Failed_Generic                 = 3,
	Failed_VotingDisabled          = 4,
	Failed_AlreadyIntent           = 5,
	Failed_TooSoon                 = 6,
	Failed_VoteFailedRecently      = 7,
	Failed_InvalidPlayer           = 8,
	Failed_TargetingAdmin          = 9,
	Failed_InvalidOption           = 10,
	Failed_InvalidTeam             = 11,
	Failed_Spectator               = 12,
	Failed_NotEnoughPlayers        = 13,
	Failed_RequireAdmin            = 14,
	MAX                            = 15,

};

// Enum Insurgency.ECastVoteResult
enum class ECastVoteResult : uint8_t
{
	Cast                           = 0,
	Failed_Generic                 = 1,
	Failed_NoVote                  = 2,
	Failed_InvalidChoice           = 3,
	Failed_NotEligible             = 4,
	Failed_NoChange                = 5,
	MAX                            = 6,

};

// Enum Insurgency.EVoteChoiceType
enum class EVoteChoiceType : uint8_t
{
	Invalid                        = 0,
	Yes                            = 1,
	No                             = 2,
	Custom                         = 3,
	MAX                            = 4,

};

// Enum Insurgency.EVoteState
enum class EVoteState : uint8_t
{
	Inactive                       = 0,
	InProgress                     = 1,
	Success                        = 2,
	Failed_Generic                 = 3,
	Failed_MoreNoThanYes           = 4,
	Failed_NotEnoughVotes          = 5,
	Failed_Dissent                 = 6,
	MAX                            = 7,

};

// Enum Insurgency.EObjectiveBotSpawnMethod
enum class EObjectiveBotSpawnMethod : uint8_t
{
	Default                        = 0,
	ClosestToPlayerSpawn           = 1,
	ClosestToObjective             = 2,
	FurthestFromObjective          = 3,
	Random                         = 4,
	MAX                            = 5,

};

// Enum Insurgency.EObjectiveType
enum class EObjectiveType : uint8_t
{
	Territory                      = 0,
	Object                         = 1,
	Waypoint                       = 2,
	Regroup                        = 3,
	Character                      = 4,
	MAX                            = 5,

};

// Enum Insurgency.EDestructibleObjectiveState
enum class EDestructibleObjectiveState : uint8_t
{
	Normal                         = 0,
	Damaged                        = 1,
	Destroyed                      = 2,
	Disabled                       = 3,
	MAX                            = 4,

};

// Enum Insurgency.ECharacterGender
enum class ECharacterGender : uint8_t
{
	Neutral                        = 0,
	Male                           = 1,
	Female                         = 2,
	MAX                            = 3,

};

// Enum Insurgency.ETaglineContextType
enum class ETaglineContextType : uint8_t
{
	None                           = 0,
	Int                            = 1,
	Float                          = 2,
	Percentage                     = 3,
	MAX                            = 4,

};

// Enum Insurgency.ERoundConclusion
enum class ERoundConclusion : uint8_t
{
	Generic                        = 0,
	Objective                      = 1,
	Objective_FullCapture          = 2,
	Elimination                    = 3,
	EliminationLastStand           = 4,
	PointLimitReached              = 5,
	TargetPlayerEliminated         = 6,
	TargetPlayerExtracted          = 7,
	RegainedCheckpoint             = 8,
	OutpostCaptured                = 9,
	Evacuation                     = 10,
	Survived                       = 11,
	TimeExpired                    = 12,
	TimeExpired_DefendersPreventedFullCapture = 13,
	TimeExpired_MajorityControlled = 14,
	TimeExpired_MostRemainingWaves = 15,
	TimeExpired_MostPoints         = 16,
	TimeExpired_OwnHillObjective   = 17,
	TimeExpired_OvertimeObjectiveReset = 18,
	Abandoned                      = 19,
	EndedByAdmin                   = 20,
	MAX                            = 21,

};

// Enum Insurgency.EMeleeSwingDirection
enum class EMeleeSwingDirection : uint8_t
{
	North                          = 0,
	South                          = 1,
	East                           = 2,
	West                           = 3,
	NorthEast                      = 4,
	SouthEast                      = 5,
	SouthWest                      = 6,
	NorthWest                      = 7,
	MAX                            = 8,

};

// Enum Insurgency.EMusicDirectorState
enum class EMusicDirectorState : uint8_t
{
	MDS_None                       = 0,
	MDS_MainMenu                   = 1,
	MDS_InitialClassSelect         = 2,
	MDS_KitUI                      = 3,
	MDS_InGame                     = 4,
	MDS_MAX                        = 5,

};

// Enum Insurgency.ESoundscapeVehicleState
enum class ESoundscapeVehicleState : uint8_t
{
	NotInVehicle                   = 0,
	InVehicleExternal              = 1,
	InVehicleInternal              = 2,
	MAX                            = 3,

};

// Enum Insurgency.ECharacterAppearanceSlot
enum class ECharacterAppearanceSlot : uint8_t
{
	Character                      = 0,
	Headgear                       = 1,
	Eyewear                        = 2,
	Facewear                       = 3,
	Arm                            = 4,
	Wrist                          = 5,
	Hands                          = 6,
	Torso                          = 7,
	Legs                           = 8,
	Feet                           = 9,
	Camo                           = 10,
	MergedMesh                     = 11,
	Equipment                      = 12,
	None                           = 13,
	Count                          = 14,
	MAX                            = 15,

};

// Enum Insurgency.ECharacterResponse
enum class ECharacterResponse : uint8_t
{
	Bot_Contact                    = 0,
	Bot_Engage                     = 1,
	Bot_Flanking                   = 2,
	Bot_HearEnemy                  = 3,
	Bot_Retreating                 = 4,
	Bot_Spot                       = 5,
	Bot_Startled                   = 6,
	Bot_Suppressing                = 7,
	Bot_SpotFlashlight             = 8,
	Chatter_AskStatus              = 9,
	Chatter_EnterVehicle           = 10,
	Chatter_EnterVehicleMachineGun = 11,
	Chatter_LeaveVehicle           = 12,
	Chatter_FlashOut               = 13,
	Chatter_FragOut                = 14,
	Chatter_IncendiaryOut          = 15,
	Chatter_MineOut                = 16,
	Chatter_MolotovOut             = 17,
	Chatter_ObjectiveClear         = 18,
	Chatter_ObjectiveHostile       = 19,
	Chatter_Reloading              = 20,
	Chatter_RemoteOut              = 21,
	Chatter_SmokeOut               = 22,
	Chatter_Breaching              = 23,
	Chatter_ChemicalGasSpotted     = 24,
	Chatter_DestroyedEnemySupport  = 25,
	Chatter_EnemyVehicleCrash      = 26,
	Chatter_EnteringCombatArea     = 27,
	Chatter_EnteringCombatAreaResponse = 28,
	Chatter_FiringMachineGun       = 29,
	Chatter_FriendlyDown           = 30,
	Chatter_FriendlyFire           = 31,
	Chatter_FriendlyVehicleCrash   = 32,
	Chatter_HeavyMeleeSwing        = 33,
	Chatter_LostFriendlySupport    = 34,
	Chatter_LowAmmo                = 35,
	Chatter_MeleeSwing             = 36,
	Chatter_MotorAccident          = 37,
	Chatter_PhysicalExertion       = 38,
	Chatter_Resupplied             = 39,
	Chatter_SearchingWeaponCache   = 40,
	Chatter_SorryAlmostHit         = 41,
	Chatter_SpotFrag               = 42,
	Chatter_SpotRemote             = 43,
	Chatter_SpotRocket             = 44,
	Chatter_StatusFineResponse     = 45,
	Chatter_StatusSuppressedResponse = 46,
	Chatter_StatusWoundedResponse  = 47,
	Chatter_SuppressedByExplosion  = 48,
	Chatter_SuppressedByFireSupport = 49,
	Chatter_SuppressedByGunfire    = 50,
	Chatter_SuppressedByMachineGun = 51,
	Chatter_SuppressedBySniper     = 52,
	Chatter_TossBackExplosive      = 53,
	Chatter_WitnessGruesomeDeath   = 54,
	Chatter_GameMode_LastOneStanding = 55,
	Chatter_GameMode_LastOneSucceeds = 56,
	Chatter_GameMode_LowReinforcements = 57,
	Chatter_GameMode_MissingCommander = 58,
	Chatter_GameMode_NoReinforcements = 59,
	Chatter_GameMode_RestrictedArea = 60,
	GameMode_AdvancingToObjective  = 61,
	GameMode_AttackingCache        = 62,
	GameMode_CounterAttackBegins   = 63,
	GameMode_CounterAttackEnds     = 64,
	GameMode_DefendingCache        = 65,
	GameMode_ObjectiveComplete     = 66,
	GameMode_PreGame               = 67,
	GameMode_RetreatingToObjective = 68,
	GameMode_CoopRoundStart        = 69,
	GameMode_VersusRoundStart      = 70,
	GameMode_Survival_MovingToExtraction = 71,
	GameMode_Survival_ReachesExtraction = 72,
	Radial_Yes                     = 73,
	Radial_No                      = 74,
	Radial_EnemyDown               = 75,
	Radial_EnemyDownMelee          = 76,
	Radial_EnemySpotted            = 77,
	Radial_EnemySpottedNorth       = 78,
	Radial_EnemySpottedNorthEast   = 79,
	Radial_EnemySpottedNorthWest   = 80,
	Radial_EnemySpottedWest        = 81,
	Radial_EnemySpottedEast        = 82,
	Radial_EnemySpottedSouth       = 83,
	Radial_EnemySpottedSouthEast   = 84,
	Radial_EnemySpottedSouthWest   = 85,
	Radial_GetIn                   = 86,
	Radial_Intimidate              = 87,
	Radial_Intimidate_Response     = 88,
	Radial_NeedBackup              = 89,
	Radial_NeedPickup              = 90,
	Radial_NeedSmoke               = 91,
	Radial_RequestRadio            = 92,
	Radial_SuggestFireSupport      = 93,
	Pain_Generic                   = 94,
	Pain_Blinded                   = 95,
	Pain_Burn                      = 96,
	Pain_ChemicalCough             = 97,
	Pain_SmokeCough                = 98,
	Pain_FlameDeath                = 99,
	Pain_DeathGrunt                = 100,
	Pain_DeathShout                = 101,
	Pain_DeathSqueal               = 102,
	None                           = 103,
	FireSupport_Incoming           = 104,
	FireSupport_Incoming_Enemy     = 105,
	FireSupport_Officer_Request    = 106,
	FireSupport_Observer_Request   = 107,
	FireSupport_Observer_Thank     = 108,
	Objective_BeginCapturingEnemyObjective = 109,
	Objective_FinishCapturingEnemyObjective = 110,
	Objective_BeingLosingFriendlyObjective = 111,
	Objective_FinishLosingFriendlyObjective = 112,
	Objective_DestroyedFriendlyObjective = 113,
	Objective_DestroyedEnemyObjective = 114,
	Max_Responses                  = 115,
	MAX                            = 116,

};

// Enum Insurgency.EUseItem
enum class EUseItem : uint8_t
{
	None                           = 0,
	Scavenging                     = 1,
	SupplyCrate                    = 2,
	MAX                            = 3,

};

// Enum Insurgency.ECompassMarkerType
enum class ECompassMarkerType : uint8_t
{
	Information                    = 0,
	Danger                         = 1,
	Order                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EScoreType
enum class EScoreType : uint8_t
{
	Kill                           = 0,
	ObjectiveCaptured              = 1,
	Other                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.ETeamRole
enum class ETeamRole : uint8_t
{
	None                           = 0,
	Attacking                      = 1,
	Defending                      = 2,
	MAX                            = 3,

};

// Enum Insurgency.EAvailablePlaylistState
enum class EAvailablePlaylistState : uint8_t
{
	Unloaded                       = 0,
	Loaded                         = 1,
	BuildOutOfDate                 = 2,
	MAX                            = 3,

};

// Enum Insurgency.EMatchmakingFailure
enum class EMatchmakingFailure : uint8_t
{
	Unknown                        = 0,
	ReservationFailure             = 1,
	JoinFailure                    = 2,
	TicketNotFound                 = 3,
	UserCancelled                  = 4,
	NotLeader                      = 5,
	LeaverBanned                   = 6,
	NoNewWorldLogin                = 7,
	BuildOutOfDate                 = 8,
	LateJoinNoTarget               = 9,
	LateJoinNotInGame              = 10,
	LateJoinFull                   = 11,
	LateJoinWrongVersion           = 12,
	MAX                            = 13,

};

// Enum Insurgency.EMatchmakingState
enum class EMatchmakingState : uint8_t
{
	NotMatchmaking                 = 0,
	SubmittingTicket               = 1,
	SearchingForMatch              = 2,
	ReadyCheck                     = 3,
	WaitingForMatch                = 4,
	ReservingSlot                  = 5,
	ReadyToJoin                    = 6,
	JoiningMatch                   = 7,
	Failed                         = 8,
	Cancelling                     = 9,
	MAX                            = 10,

};

// Enum Insurgency.EMusicEvent
enum class EMusicEvent : uint8_t
{
	RoundStart                     = 0,
	RoundWin                       = 1,
	RoundLose                      = 2,
	LastManStart                   = 3,
	LastManEnd                     = 4,
	CounterAttack                  = 5,
	CounterAttackFinal             = 6,
	MoveToExtraction               = 7,
	DefendExtractionPoint          = 8,
	MAX                            = 9,

};

// Enum Insurgency.EStationResponse
enum class EStationResponse : uint8_t
{
	Station_FireSupportAvailable   = 0,
	Station_FireSupportDidNotHear  = 1,
	Station_FireSupportReminder    = 2,
	Station_Survival_ExtractionConfirmed = 3,
	Station_Survival_ExtractionOnTheWay = 4,
	Max_Responses                  = 5,
	Station_FireSupportStart       = 6,
	Station_FireSupportEnd         = 7,
	Station_FireSupportDestroyed   = 8,
	Max_Status_Responses           = 9,
	MAX                            = 10,

};

// Enum Insurgency.EFloatingObjectiveVisibilitySetting
enum class EFloatingObjectiveVisibilitySetting : uint8_t
{
	ShowAll                        = 0,
	ShowActiveOnly                 = 1,
	HideFarSecondaryObjectives     = 2,
	MAX                            = 3,

};

// Enum Insurgency.EVoiceChatChannelFlags
enum class EVoiceChatChannelFlags : uint8_t
{
	None                           = 0,
	Radio                          = 1,
	Local                          = 2,
	Dead                           = 3,
	Intermission                   = 4,
	Spectator                      = 5,
	LocalTeamSpecific              = 6,
	SeparateRadioLocal             = 7,
	MAX                            = 8,

};

// Enum Insurgency.ESwayMethod
enum class ESwayMethod : uint8_t
{
	PerlinNoise                    = 0,
	Lissajous                      = 1,
	MAX                            = 2,

};

// Enum Insurgency.EGrenadeState
enum class EGrenadeState : uint8_t
{
	Idle                           = 0,
	PullingBack                    = 1,
	Throwing                       = 2,
	Reloading                      = 3,
	MAX                            = 4,

};

// Enum Insurgency.EGrenadeThrowMode
enum class EGrenadeThrowMode : uint8_t
{
	None                           = 0,
	Released                       = 1,
	Overhand                       = 2,
	OverhandCooking                = 3,
	Underhand                      = 4,
	UnderhandCooking               = 5,
	MAX                            = 6,

};

// Enum Insurgency.EGrenadeCategory
enum class EGrenadeCategory : uint8_t
{
	Smoke                          = 0,
	Flash                          = 1,
	Fragmentation                  = 2,
	Incendiary                     = 3,
	Remote                         = 4,
	Rocket                         = 5,
	Mine                           = 6,
	MAX                            = 7,

};

// Enum Insurgency.ERevolverChamberState
enum class ERevolverChamberState : uint8_t
{
	Empty                          = 0,
	Fired                          = 1,
	Ready                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EBipodState
enum class EBipodState : uint8_t
{
	Undeployed                     = 0,
	Deploying                      = 1,
	Deployed                       = 2,
	Retracting                     = 3,
	MAX                            = 4,

};

// Enum Insurgency.EPickupType
enum class EPickupType : uint8_t
{
	RemoveForever                  = 0,
	RemoveTimed                    = 1,
	DontRemove                     = 2,
	MAX                            = 3,

};

// Enum Insurgency.EAmmoContainerType
enum class EAmmoContainerType : uint8_t
{
	Mag                            = 0,
	ExtMag                         = 1,
	Drum                           = 2,
	Box                            = 3,
	GrenadeLauncher                = 4,
	RocketLauncher                 = 5,
	Shells                         = 6,
	MAX                            = 7,

};

// Enum Insurgency.EAnimationType
enum class EAnimationType : uint8_t
{
	None                           = 0,
	Pistol                         = 1,
	Rifle                          = 2,
	Bolt                           = 3,
	Shotgun                        = 4,
	Grenade                        = 5,
	Explosive                      = 6,
	Launcher                       = 7,
	GL                             = 8,
	Binoculars                     = 9,
	MAX                            = 10,

};

// Enum Insurgency.EIKSpecialScenario
enum class EIKSpecialScenario : uint8_t
{
	None                           = 0,
	LeftRightWeapon                = 1,
	LeftRightKnees                 = 2,
	LeftRightHips                  = 3,
	MAX                            = 4,

};

// Enum Insurgency.EIKAOScenario
enum class EIKAOScenario : uint8_t
{
	Firearm                        = 0,
	OneHanded                      = 1,
	MAX                            = 2,

};

// Enum Insurgency.EIKVectorScenario
enum class EIKVectorScenario : uint8_t
{
	Normal                         = 0,
	Vehicle                        = 1,
	Reload                         = 2,
	Melee                          = 3,
	MAX                            = 4,

};

// Enum Insurgency.ETickUpdateSetting
enum class ETickUpdateSetting : uint8_t
{
	Normal                         = 0,
	VeryFast                       = 1,
	Fast                           = 2,
	Medium                         = 3,
	Slow                           = 4,
	VerySlow                       = 5,
	MAX                            = 6,

};

// Enum Insurgency.EAnimCardinalDirection
enum class EAnimCardinalDirection : uint8_t
{
	North                          = 0,
	East                           = 1,
	South                          = 2,
	West                           = 3,
	Zero                           = 4,
	MAX                            = 5,

};

// Enum Insurgency.EAnimDirection
enum class EAnimDirection : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	Up                             = 2,
	Down                           = 3,
	None                           = 4,
	MAX                            = 5,

};

// Enum Insurgency.EAnimType
enum class EAnimType : uint8_t
{
	Firearm                        = 0,
	Explosive                      = 1,
	Launcher                       = 2,
	Melee                          = 3,
	Misc                           = 4,
	TotalSlots                     = 5,
	MAX                            = 6,

};

// Enum Insurgency.EWeaponReloadType
enum class EWeaponReloadType : uint8_t
{
	Normal                         = 0,
	Fast                           = 1,
	FastFB                         = 2,
	Deployed                       = 3,
	FastDeployed                   = 4,
	FastDeployedFB                 = 5,
	Single                         = 6,
	DeployedSingle                 = 7,
	MAX                            = 8,

};

// Enum Insurgency.EWeaponReloadStage
enum class EWeaponReloadStage : uint8_t
{
	Normal                         = 0,
	BoltPull                       = 1,
	MagIn                          = 2,
	Fallback                       = 3,
	MAX                            = 4,

};

// Enum Insurgency.EWeaponPosture
enum class EWeaponPosture : uint8_t
{
	Normal                         = 0,
	Iron                           = 1,
	Down                           = 2,
	ProneTransition                = 3,
	Jump                           = 4,
	Falling                        = 5,
	Vaulting                       = 6,
	VaultRecovery                  = 7,
	Sliding                        = 8,
	MAX                            = 9,

};

// Enum Insurgency.EWeaponMovement
enum class EWeaponMovement : uint8_t
{
	Normal                         = 0,
	Sprint                         = 1,
	Crawl                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EFireModeAnimation
enum class EFireModeAnimation : uint8_t
{
	AutoSemi                       = 0,
	AutoBurst                      = 1,
	BurstSemi                      = 2,
	BurstAuto                      = 3,
	SemiBurst                      = 4,
	SemiAuto                       = 5,
	MAX                            = 6,

};

// Enum Insurgency.EDamageAnimType
enum class EDamageAnimType : uint8_t
{
	Melee                          = 0,
	Explosive                      = 1,
	Flashed                        = 2,
	Chemical                       = 3,
	Projectile                     = 4,
	MAX                            = 5,

};

// Enum Insurgency.ECharacterPosture
enum class ECharacterPosture : uint8_t
{
	Relaxed                        = 0,
	Normal                         = 1,
	Iron                           = 2,
	MAX                            = 3,

};

// Enum Insurgency.ECharacterMovement
enum class ECharacterMovement : uint8_t
{
	Idle                           = 0,
	SlowWalk                       = 1,
	IronWalk                       = 2,
	Walk                           = 3,
	IronMove                       = 4,
	Move                           = 5,
	Sprint                         = 6,
	MAX                            = 7,

};

// Enum Insurgency.ECharacterAOType
enum class ECharacterAOType : uint8_t
{
	Relaxed                        = 0,
	Normal                         = 1,
	Iron                           = 2,
	LeanLeft                       = 3,
	LeanRight                      = 4,
	MAX                            = 5,

};

// Enum Insurgency.ECharacterAnimsetBase
enum class ECharacterAnimsetBase : uint8_t
{
	Rifle                          = 0,
	Pistol                         = 1,
	Launcher                       = 2,
	Melee                          = 3,
	Grenade                        = 4,
	Explosive                      = 5,
	MAX                            = 6,

};

// Enum Insurgency.EUIHUDSound
enum class EUIHUDSound : uint8_t
{
	OutpostLostObjective           = 0,
	OutpostPrepareNextWave         = 1,
	OutpostIncomingWaveNormal      = 2,
	OutpostIncomingWaveSpecial     = 3,
	OutpostIncomingWaveFinal       = 4,
	MAX                            = 5,

};

// Enum Insurgency.EUILoadoutSound
enum class EUILoadoutSound : uint8_t
{
	Primary                        = 0,
	Secondary                      = 1,
	Explosive                      = 2,
	Carrier                        = 3,
	Armor                          = 4,
	Accessory                      = 5,
	Attachment                     = 6,
	Unequip                        = 7,
	Select                         = 8,
	MAX                            = 9,

};

// Enum Insurgency.EUISound
enum class EUISound : uint8_t
{
	Hover                          = 0,
	Navigate                       = 1,
	Select                         = 2,
	MatchReadyStinger              = 3,
	Pause                          = 4,
	FindMatch                      = 5,
	CosmeticReward                 = 6,
	ClassUnlock                    = 7,
	LevelUp                        = 8,
	SupplyGained                   = 9,
	MAX                            = 10,

};

// Enum Insurgency.EBotBehaviorReturnResult
enum class EBotBehaviorReturnResult : uint8_t
{
	Running                        = 0,
	Done                           = 1,
	MAX                            = 2,

};

// Enum Insurgency.EBotBehaviorPriority
enum class EBotBehaviorPriority : uint8_t
{
	None                           = 0,
	Base                           = 1,
	IdleLow                        = 2,
	IdleMedium                     = 3,
	IdleHigh                       = 4,
	Alert                          = 5,
	CombatLow                      = 6,
	CombatLowElevated              = 7,
	CombatMedium                   = 8,
	CombatHigh                     = 9,
	Utility                        = 10,
	MAX                            = 11,

};

// Enum Insurgency.EBotKnownQuery
enum class EBotKnownQuery : uint8_t
{
	QUERY_FRIENDLY                 = 0,
	QUERY_ENEMY                    = 1,
	QUERY_NEUTRALS                 = 2,
	QUERY_ALL                      = 3,
	MAX_STATES                     = 4,
	MAX                            = 5,

};

// Enum Insurgency.EBotAIMood
enum class EBotAIMood : uint8_t
{
	MOOD_CALM                      = 0,
	MOOD_NERVOUS                   = 1,
	MOOD_COWERING                  = 2,
	MOOD_PANICKING                 = 3,
	MAX_STATES                     = 4,
	MAX                            = 5,

};

// Enum Insurgency.EBloodSplatterType
enum class EBloodSplatterType : uint8_t
{
	Ground                         = 0,
	WallGeneric                    = 1,
	WallDrip                       = 2,
	Headshot                       = 3,
	Vaporization                   = 4,
	MAX                            = 5,

};

// Enum Insurgency.EGearCombination
enum class EGearCombination : uint8_t
{
	HeavyCarrierHeavyArmour        = 0,
	HeavyCarrierLightArmour        = 1,
	HeavyCarrierNoArmour           = 2,
	LightCarrierHeavyArmour        = 3,
	LightCarrierLightArmour        = 4,
	LightCarrierNoArmour           = 5,
	NoCarrierHeavyArmour           = 6,
	NoCarrierLightArmour           = 7,
	NoCarrierNoArmour              = 8,
	None                           = 9,
	MAX                            = 10,

};

// Enum Insurgency.EAppearanceEquipmentSubSlot
enum class EAppearanceEquipmentSubSlot : uint8_t
{
	Carrier                        = 0,
	Backpack                       = 1,
	HeavyBackpack                  = 2,
	Count                          = 3,
	MAX                            = 4,

};

// Enum Insurgency.EAppearanceArmSubSlot
enum class EAppearanceArmSubSlot : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	Count                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EAppearanceCharacterSubSlot
enum class EAppearanceCharacterSubSlot : uint8_t
{
	None                           = 0,
	Head                           = 1,
	Hair                           = 2,
	FacialHair                     = 3,
	HairColor                      = 4,
	Eyecolor                       = 5,
	Skintone                       = 6,
	LeftArmTattoo                  = 7,
	RightArmTattoo                 = 8,
	Voice                          = 9,
	Count                          = 10,
	MAX                            = 11,

};

// Enum Insurgency.ECollectibleType
enum class ECollectibleType : uint8_t
{
	Item                           = 0,
	Bundle                         = 1,
	MAX                            = 2,

};

// Enum Insurgency.ECollectibleTier
enum class ECollectibleTier : uint8_t
{
	Bronze                         = 0,
	Silver                         = 1,
	Gold                           = 2,
	Platinum                       = 3,
	Diamond                        = 4,
	MAX                            = 5,

};

// Enum Insurgency.ECollectibleClaimType
enum class ECollectibleClaimType : uint8_t
{
	Free                           = 0,
	DLC                            = 1,
	ExternalInventory              = 2,
	Achievement                    = 3,
	MAX                            = 4,

};

// Enum Insurgency.ECollectibleRarity
enum class ECollectibleRarity : uint8_t
{
	OwnedByAll                     = 0,
	Common                         = 1,
	Uncommon                       = 2,
	Rare                           = 3,
	VeryRare                       = 4,
	Exotic                         = 5,
	Unavailable                    = 6,
	Claim                          = 7,
	Developer                      = 8,
	CompetitiveUnlockable          = 9,
	Bundle                         = 10,
	Hidden                         = 11,
	MAX                            = 12,

};

// Enum Insurgency.ECosmeticEyeColor
enum class ECosmeticEyeColor : uint8_t
{
	DarkBrown                      = 0,
	Brown                          = 1,
	Hazel                          = 2,
	Grey                           = 3,
	Green                          = 4,
	Blue                           = 5,
	MAX                            = 6,

};

// Enum Insurgency.ECosmeticPoolReservationType
enum class ECosmeticPoolReservationType : uint8_t
{
	None                           = 0,
	Soldier                        = 1,
	MAX                            = 2,

};

// Enum Insurgency.EDeathCameraMode
enum class EDeathCameraMode : uint8_t
{
	TrackAll                       = 0,
	FocusOnPlayer                  = 1,
	MAX                            = 2,

};

// Enum Insurgency.EDoorDirection
enum class EDoorDirection : uint8_t
{
	Forward                        = 0,
	Backward                       = 1,
	Bothways                       = 2,
	MAX                            = 3,

};

// Enum Insurgency.EDoorBotSlot
enum class EDoorBotSlot : uint8_t
{
	Opening                        = 0,
	Waiting_Pull_Right             = 1,
	Waiting_Pull_Right01           = 2,
	Waiting_Pull_Right02           = 3,
	Waiting_Push_Left              = 4,
	Waiting_Push_Left01            = 5,
	Waiting_Push_Left02            = 6,
	Waiting_Push_Right             = 7,
	Waiting_Push_Right01           = 8,
	Waiting_Push_Right02           = 9,
	MaxDoorSlots                   = 10,
	MAX                            = 11,

};

// Enum Insurgency.EDoorType
enum class EDoorType : uint8_t
{
	Wood                           = 0,
	Metal                          = 1,
	ReinforcedSteel                = 2,
	MAX                            = 3,

};

// Enum Insurgency.EDoorState
enum class EDoorState : uint8_t
{
	Closed                         = 0,
	CreakyOpen                     = 1,
	PartiallyOpen                  = 2,
	Open                           = 3,
	Opening                        = 4,
	BreachOpening                  = 5,
	Closing                        = 6,
	BreachClosing                  = 7,
	FallingTowardsInside           = 8,
	FallingTowardsOutside          = 9,
	Fallen                         = 10,
	Destroyed                      = 11,
	MAX                            = 12,

};

// Enum Insurgency.EFactionAnimationStyle
enum class EFactionAnimationStyle : uint8_t
{
	Untrained                      = 0,
	Military                       = 1,
	MAX                            = 2,

};

// Enum Insurgency.EAircraftMovementState
enum class EAircraftMovementState : uint8_t
{
	ContinueStraight               = 0,
	FlyBackToOrigin                = 1,
	PeelOff                        = 2,
	FlyToDestination               = 3,
	MAX                            = 4,

};

// Enum Insurgency.EHoveringFireSupportDialogue
enum class EHoveringFireSupportDialogue : uint8_t
{
	Arriving                       = 0,
	Leaving                        = 1,
	StartFalling                   = 2,
	BeginDodge                     = 3,
	FinishDodge                    = 4,
	LostGunner1                    = 5,
	LostGunner2                    = 6,
	TakingFire                     = 7,
	TakingDamage                   = 8,
	Death                          = 9,
	Killed_Generic                 = 10,
	Killed                         = 11,
	Killed01                       = 12,
	Killed02                       = 13,
	Killed03                       = 14,
	Killed04                       = 15,
	Killed05                       = 16,
	Killed06                       = 17,
	Killed07                       = 18,
	Killed08                       = 19,
	Killed09                       = 20,
	Killed_Many                    = 21,
	MaxResponses                   = 22,
	MAX                            = 23,

};

// Enum Insurgency.EFoliageInteractionType
enum class EFoliageInteractionType : uint8_t
{
	Always                         = 0,
	OnlyMoving                     = 1,
	MAX                            = 2,

};

// Enum Insurgency.EFileSizeUnit
enum class EFileSizeUnit : uint8_t
{
	Bytes                          = 0,
	Kilobytes                      = 1,
	Megabytes                      = 2,
	Gigabytes                      = 3,
	Terabytes                      = 4,
	MAX                            = 5,

};

// Enum Insurgency.ECardinalDirection
enum class ECardinalDirection : uint8_t
{
	North                          = 0,
	NorthEast                      = 1,
	East                           = 2,
	SouthEast                      = 3,
	South                          = 4,
	SouthWest                      = 5,
	West                           = 6,
	NorthWest                      = 7,
	MAX                            = 8,

};

// Enum Insurgency.EAssetName
enum class EAssetName : uint8_t
{
	CycleOpticsHint                = 0,
	UnderbarrelHint                = 1,
	ToggleAccessory                = 2,
	SiderailHint                   = 3,
	ChangeClassHint                = 4,
	Count                          = 5,
	MAX                            = 6,

};

// Enum Insurgency.EBotInvestigationPriority
enum class EBotInvestigationPriority : uint8_t
{
	INVESTIGATION_TYPE_NONE        = 0,
	INVESTIGATION_TYPE_CURIOSITY   = 1,
	INVESTIGATION_TYPE_CP          = 2,
	INVESTIGATION_TYPE_ENEMY_CP    = 3,
	INVESTIGATION_TYPE_THREAT      = 4,
	INVESTIGATION_TYPE_MAX         = 5,

};

// Enum Insurgency.EBotCoverSearchPriority
enum class EBotCoverSearchPriority : uint8_t
{
	COVER_PRIORITY_CLOSEST_TO_SEARCHORIGIN = 0,
	COVER_PRIORITY_CLOSEST_TO_FRONTLINE = 1,
	COVER_PRIORITY_FURTHEST_FROM_SEARCHORIGIN = 2,
	COVER_PRIORITY_FURTHEST_FROM_FRONTLINE = 3,
	COVER_PRIORITY_MAX             = 4,

};

// Enum Insurgency.EBotCoverSearchOrientation
enum class EBotCoverSearchOrientation : uint8_t
{
	COVER_AHEAD                    = 0,
	COVER_AHEAD_AND_TO_SIDES       = 1,
	COVER_BEHIND                   = 2,
	COVER_ANY                      = 3,
	COVER_MAX                      = 4,

};

// Enum Insurgency.EAIDesiredLookAtPriority
enum class EAIDesiredLookAtPriority : uint8_t
{
	Idle                           = 0,
	Movement                       = 1,
	Interesting                    = 2,
	LastSeenThreat                 = 3,
	Footsteps                      = 4,
	Sprint                         = 5,
	Gunshot                        = 6,
	Enemy                          = 7,
	Forced                         = 8,
	MAX                            = 9,

};

// Enum Insurgency.EAIDesiredLocomotionPriority
enum class EAIDesiredLocomotionPriority : uint8_t
{
	None                           = 0,
	Low                            = 1,
	Normal                         = 2,
	Important                      = 3,
	Critical                       = 4,
	Forced                         = 5,
	MAX                            = 6,

};

// Enum Insurgency.EAIDesiredLocomotion
enum class EAIDesiredLocomotion : uint8_t
{
	Walk                           = 0,
	Run                            = 1,
	Sprint                         = 2,
	MAX                            = 3,

};

// Enum Insurgency.EAISquadRole
enum class EAISquadRole : uint8_t
{
	SquadRole_Unassigned           = 0,
	SquadRole_Suppression          = 1,
	SquadRole_FragGrenadier        = 2,
	SquadRole_SmokeGrenadier       = 3,
	SquadRole_Flanker              = 4,
	SquadRole_Rocketeer            = 5,
	SquadRole_Ambusher             = 6,
	SquadRole_MAX                  = 7,

};

// Enum Insurgency.EAIVehicleSteeringState
enum class EAIVehicleSteeringState : uint8_t
{
	STEERING_DRIVING_FORWARD       = 0,
	STEERING_STUCK_AND_REVERSING   = 1,
	STEERING_MAX                   = 2,

};

// Enum Insurgency.EMainMenuPage
enum class EMainMenuPage : uint8_t
{
	Main                           = 0,
	Tutorials                      = 1,
	Multiplayer                    = 2,
	ServerBrowser                  = 3,
	LocalGame                      = 4,
	Settings                       = 5,
	Profile                        = 6,
	Character                      = 7,
	PostMatch                      = 8,
	Quit                           = 9,
	Announcement                   = 10,
	Recap                          = 11,
	CreateCustomGame               = 12,
	Credits                        = 13,
	Mods                           = 14,
	LanguageSelect                 = 15,
	MAX                            = 16,

};

// Enum Insurgency.EPawnSpawnLocationMethod
enum class EPawnSpawnLocationMethod : uint8_t
{
	Default                        = 0,
	NavSpawning                    = 1,
	SpawnAtCoordinates             = 2,
	MAX                            = 3,

};

// Enum Insurgency.EPresenceState
enum class EPresenceState : uint8_t
{
	Playing                        = 0,
	PlayingPlaylistMapMode         = 1,
	PlayingMapMode                 = 2,
	ViewingReplay                  = 3,
	InQueue                        = 4,
	InQueueFor                     = 5,
	MainMenu                       = 6,
	ViewingMatchResults            = 7,
	MAX                            = 8,

};

// Enum Insurgency.EUTSessionHelperJoinState
enum class EUTSessionHelperJoinState : uint8_t
{
	NotJoining                     = 0,
	RequestingReservation          = 1,
	FailedReservation              = 2,
	WaitingOnGame                  = 3,
	AttemptingJoin                 = 4,
	JoiningSession                 = 5,
	FailedJoin                     = 6,
	MAX                            = 7,

};

// Enum Insurgency.EINSSessionHelperJoinResult
enum class EINSSessionHelperJoinResult : uint8_t
{
	NoResult                       = 0,
	ReservationSuccess             = 1,
	ReservationFailure             = 2,
	JoinSessionSuccess             = 3,
	JoinSessionFailure             = 4,
	MAX                            = 5,

};

// Enum Insurgency.ELadderType
enum class ELadderType : uint8_t
{
	Metal                          = 0,
	Wood                           = 1,
	MAX                            = 2,

};

// Enum Insurgency.EMapVoteConclusion
enum class EMapVoteConclusion : uint8_t
{
	Failed                         = 0,
	TravelToMap                    = 1,
	PlayAgain                      = 2,
	MAX                            = 3,

};

// Enum Insurgency.EMarketingCharacterWeaponAesthetic
enum class EMarketingCharacterWeaponAesthetic : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterWeaponMagazine
enum class EMarketingCharacterWeaponMagazine : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterWeaponSiderail
enum class EMarketingCharacterWeaponSiderail : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterWeaponUnderbarrel
enum class EMarketingCharacterWeaponUnderbarrel : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterWeaponSight
enum class EMarketingCharacterWeaponSight : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterCarrierVariation
enum class EMarketingCharacterCarrierVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterArmorVariation
enum class EMarketingCharacterArmorVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterFeetVariation
enum class EMarketingCharacterFeetVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterLegsVariation
enum class EMarketingCharacterLegsVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterHandsVariation
enum class EMarketingCharacterHandsVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterTorsoVariation
enum class EMarketingCharacterTorsoVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterEyewearVariation
enum class EMarketingCharacterEyewearVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterFacewearVariation
enum class EMarketingCharacterFacewearVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterHeadgearVariation
enum class EMarketingCharacterHeadgearVariation : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterEquipmentLevel
enum class EMarketingCharacterEquipmentLevel : uint8_t
{
	None                           = 0,
	INS_None                       = 1,
	INS_Light                      = 2,
	INS_Heavy                      = 3,
	SEC_None                       = 4,
	SEC_Light                      = 5,
	SEC_Heavy                      = 6,
	MAX                            = 7,

};

// Enum Insurgency.EMarketingCharacterFeet
enum class EMarketingCharacterFeet : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterLegs
enum class EMarketingCharacterLegs : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterHands
enum class EMarketingCharacterHands : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterTorso
enum class EMarketingCharacterTorso : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterEyewear
enum class EMarketingCharacterEyewear : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterFacewear
enum class EMarketingCharacterFacewear : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterHeadgear
enum class EMarketingCharacterHeadgear : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterSkinTone
enum class EMarketingCharacterSkinTone : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterEyeColour
enum class EMarketingCharacterEyeColour : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterHairColor
enum class EMarketingCharacterHairColor : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterFacialHair
enum class EMarketingCharacterFacialHair : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterHair
enum class EMarketingCharacterHair : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.EMarketingCharacterHead
enum class EMarketingCharacterHead : uint8_t
{
	Default                        = 0,
	MAX                            = 1,

};

// Enum Insurgency.ECharacterCosmeticSlots
enum class ECharacterCosmeticSlots : uint8_t
{
	Head                           = 0,
	Hair                           = 1,
	FacialHair                     = 2,
	HairColour                     = 3,
	LeftArmTattoo                  = 4,
	RightArmTattoo                 = 5,
	EyeColour                      = 6,
	SkinTone                       = 7,
	Headgear                       = 8,
	Facewear                       = 9,
	Eyewear                        = 10,
	Torso                          = 11,
	Hands                          = 12,
	Legs                           = 13,
	Feet                           = 14,
	Equipment                      = 15,
	MAX                            = 16,

};

// Enum Insurgency.EModPrimaryAssetType
enum class EModPrimaryAssetType : uint8_t
{
	Map                            = 0,
	Item                           = 1,
	WeaponUpgrade                  = 2,
	ScenarioMultiplayer            = 3,
	Ruleset                        = 4,
	Mutator                        = 5,
	MAX                            = 6,

};

// Enum Insurgency.EObjectiveActionType
enum class EObjectiveActionType : uint8_t
{
	None                           = 0,
	Vault                          = 1,
	Sprint                         = 2,
	Lean                           = 3,
	AimAndFire                     = 4,
	Slide                          = 5,
	Breach                         = 6,
	MAX                            = 7,

};

// Enum Insurgency.ECaptureState
enum class ECaptureState : uint8_t
{
	Idle                           = 0,
	WaitingForMorePlayers          = 1,
	Capturing                      = 2,
	Stalemate                      = 3,
	BlockedByEnemy                 = 4,
	BlockedByObjective             = 5,
	BlockedByOther                 = 6,
	Reversing                      = 7,
	MAX                            = 8,

};

// Enum Insurgency.EObjectiveRelationship
enum class EObjectiveRelationship : uint8_t
{
	Neutral                        = 0,
	Friendly                       = 1,
	Enemy                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.eInventoryItemState
enum class EeInventoryItemState : uint8_t
{
	Unclaimed                      = 0,
	Owned                          = 1,
	Used                           = 2,
	Expired                        = 3,
	Frozen                         = 4,
	Returned                       = 5,
	LevelCashed                    = 6,
	eInventoryItemState_MAX        = 7,

};

// Enum Insurgency.eInventoryTransactionType
enum class EeInventoryTransactionType : uint8_t
{
	Rank                           = 0,
	Award                          = 1,
	Development                    = 2,
	Market                         = 3,
	Purchase                       = 4,
	Promotion                      = 5,
	TokenPurchase                  = 6,
	Return                         = 7,
	Reclaim                        = 8,
	LevelCash                      = 9,
	eInventoryTransactionType_MAX  = 10,

};

// Enum Insurgency.EOSSNetworkState
enum class EOSSNetworkState : uint8_t
{
	Connecting                     = 0,
	Connected                      = 1,
	Error                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EPlayableAreaType
enum class EPlayableAreaType : uint8_t
{
	PlayableArea                   = 0,
	OverviewArea                   = 1,
	MAX                            = 2,

};

// Enum Insurgency.EPlayerClassFlags
enum class EPlayerClassFlags : uint8_t
{
	Officer                        = 0,
	Observer                       = 1,
	Special                        = 2,
	MAX                            = 3,

};

// Enum Insurgency.EPlaylistLightingType
enum class EPlaylistLightingType : uint8_t
{
	Day                            = 0,
	Night                          = 1,
	DayAndNight                    = 2,
	MAX                            = 3,

};

// Enum Insurgency.ENetworkState
enum class ENetworkState : uint8_t
{
	Connecting                     = 0,
	Connected                      = 1,
	Error                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EFilterType
enum class EFilterType : uint8_t
{
	Match                          = 0,
	NotMatch                       = 1,
	MAX                            = 2,

};

// Enum Insurgency.EFilterAction
enum class EFilterAction : uint8_t
{
	Exclude                        = 0,
	ForceUpgrade                   = 1,
	MAX                            = 2,

};

// Enum Insurgency.ERenderTargetSlot
enum class ERenderTargetSlot : uint8_t
{
	Scope                          = 0,
	AfterImage                     = 1,
	Max                            = 2,

};

// Enum Insurgency.EServerEntryType
enum class EServerEntryType : uint8_t
{
	OfficialRules                  = 0,
	CustomRules                    = 1,
	Mutated                        = 2,
	Modded                         = 3,
	MAX                            = 4,

};

// Enum Insurgency.EServerListSortType
enum class EServerListSortType : uint8_t
{
	Ping                           = 0,
	Name                           = 1,
	Players                        = 2,
	MaxPlayers                     = 3,
	Gamemode                       = 4,
	Level                          = 5,
	Passworded                     = 6,
	Ranked                         = 7,
	ServerType                     = 8,
	MAX                            = 9,

};

// Enum Insurgency.EVehicleStance
enum class EVehicleStance : uint8_t
{
	Seated                         = 0,
	Ducking                        = 1,
	LookingOutWindowRight          = 2,
	LookingOutWindowLeft           = 3,
	MAX                            = 4,

};

// Enum Insurgency.EVaultAction
enum class EVaultAction : uint8_t
{
	None                           = 0,
	LowVault                       = 1,
	LowVaultJumping                = 2,
	LowClimb                       = 3,
	LowJumpClimb                   = 4,
	HighVault                      = 5,
	HighVaultJumping               = 6,
	HighClimb                      = 7,
	HighJumpClimb                  = 8,
	MAX                            = 9,

};

// Enum Insurgency.ELadderState
enum class ELadderState : uint8_t
{
	Climbing                       = 0,
	Sliding                        = 1,
	ViewLeft                       = 2,
	ViewRight                      = 3,
	TransitionStart                = 4,
	TransitionEnd                  = 5,
	Grab                           = 6,
	Top                            = 7,
	Bottom                         = 8,
	Side                           = 9,
	Leap                           = 10,
	MAX                            = 11,

};

// Enum Insurgency.ESoldierStanceTransition
enum class ESoldierStanceTransition : uint8_t
{
	None                           = 0,
	StandToCrouch                  = 1,
	CrouchToProne                  = 2,
	ProneToCrouch                  = 3,
	CrouchToStand                  = 4,
	CrouchToUnknown                = 5,
	MAX                            = 6,

};

// Enum Insurgency.ECustomMoveMode
enum class ECustomMoveMode : uint8_t
{
	Invalid                        = 0,
	Climbing                       = 1,
	Charging                       = 2,
	Vaulting                       = 3,
	Max                            = 4,

};

// Enum Insurgency.EFootstepEffectType
enum class EFootstepEffectType : uint8_t
{
	Normal                         = 0,
	Sliding                        = 1,
	MAX                            = 2,

};

// Enum Insurgency.EFootstepFoot
enum class EFootstepFoot : uint8_t
{
	None                           = 0,
	Left                           = 1,
	Right                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.EPlayerSpeedClassification
enum class EPlayerSpeedClassification : uint8_t
{
	Walk                           = 0,
	Run                            = 1,
	Sprint                         = 2,
	MAX                            = 3,

};

// Enum Insurgency.ESuppressionContext
enum class ESuppressionContext : uint8_t
{
	Default                        = 0,
	Bullet                         = 1,
	BulletSniper                   = 2,
	BulletMG                       = 3,
	Rocket                         = 4,
	Stunned                        = 5,
	ExplosionGeneral               = 6,
	ExplosionRocket                = 7,
	ChemicalAgent                  = 8,
	Impact                         = 9,
	FireSupport                    = 10,
	NoSound                        = 11,
	MAX                            = 12,

};

// Enum Insurgency.ELeanDirection
enum class ELeanDirection : uint8_t
{
	Left                           = 0,
	None                           = 1,
	Right                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.ESoundscapeStateType
enum class ESoundscapeStateType : uint8_t
{
	FullState                      = 0,
	OnlyWeaponTail                 = 1,
	MAX                            = 2,

};

// Enum Insurgency.ESpawnerVehicleType
enum class ESpawnerVehicleType : uint8_t
{
	Standard                       = 0,
	PlayerInsertionVehicle         = 1,
	EscortInsertionVehicle         = 2,
	MAX                            = 3,

};

// Enum Insurgency.eWeaponStatsSortState
enum class EeWeaponStatsSortState : uint8_t
{
	eWeaponStatsSortState__WeaponSortNone = 0,
	eWeaponStatsSortState__WeaponSortAccuracyAscending = 1,
	eWeaponStatsSortState__WeaponSortAccuracyDescending = 2,
	eWeaponStatsSortState__WeaponSortKillsAscending = 3,
	eWeaponStatsSortState__WeaponSortKillsDescending = 4,
	eWeaponStatsSortState__WeaponSortTimeAscending = 5,
	eWeaponStatsSortState__WeaponSortTimeDescending = 6,
	eWeaponStatsSortState__WeaponSortHeadshotsAscending = 7,
	eWeaponStatsSortState__WeaponSortHeadshotsDescending = 8,
	eWeaponStatsSortState__WeaponSortNameAscending = 9,
	eWeaponStatsSortState__WeaponSortNameDescending = 10,
	eWeaponStatsSortState__eWeaponStatsSortState_MAX = 11,

};

// Enum Insurgency.EStatisticsKillEventPlayerRole
enum class EStatisticsKillEventPlayerRole : uint8_t
{
	Inflictor                      = 0,
	Assistor                       = 1,
	Victim                         = 2,
	MAX                            = 3,

};

// Enum Insurgency.EStatisticsPlayerKillFlags
enum class EStatisticsPlayerKillFlags : uint8_t
{
	NONE                           = 0,
	DOMINATION                     = 1,
	SAVIOR                         = 2,
	OFFENSIVE                      = 3,
	DEFENSIVE                      = 4,
	HEADSHOT                       = 5,
	CRITICAL                       = 6,
	FINALKILL                      = 7,
	SILENCED                       = 8,
	MAX                            = 9,

};

// Enum Insurgency.EStatisticsPlayerSightFlags
enum class EStatisticsPlayerSightFlags : uint8_t
{
	NONE                           = 0,
	HIP                            = 1,
	ADS                            = 2,
	FOCUS                          = 3,
	IRONSIGHT                      = 4,
	SIGHTS                         = 5,
	SCOPE                          = 6,
	OPTICS                         = 7,
	BIPOD                          = 8,
	MAX                            = 9,

};

// Enum Insurgency.EStatisticsPlayerStanceFlags
enum class EStatisticsPlayerStanceFlags : uint8_t
{
	NONE                           = 0,
	PRONE                          = 1,
	CROUCH                         = 2,
	STAND                          = 3,
	INWALK                         = 4,
	INJOG                          = 5,
	INSPRINT                       = 6,
	INLEAN                         = 7,
	ATTACHED                       = 8,
	MAX                            = 9,

};

// Enum Insurgency.EStatisticsPlayerFloatStats
enum class EStatisticsPlayerFloatStats : uint8_t
{
	FirstPlayerFloatStat           = 0,
	DistanceCrouchWalk             = 1,
	DistanceDriver                 = 2,
	DistanceGunner                 = 3,
	DistancePassenger              = 4,
	DistanceProneCrawl             = 5,
	DistanceSlide                  = 6,
	DistanceSprint                 = 7,
	DistanceTraveled               = 8,
	DistanceWalk                   = 9,
	DistanceLean                   = 10,
	TimeCrouch                     = 11,
	TimeDriver                     = 12,
	TimeGunner                     = 13,
	TimePassenger                  = 14,
	TimeProne                      = 15,
	TimeSlide                      = 16,
	TimeSprint                     = 17,
	TimeWalk                       = 18,
	TimeLean                       = 19,
	TimePlayed                     = 20,
	TimeInObjective                = 21,
	TimeCapturingObjective         = 22,
	TimeAlive                      = 23,
	TimeBlockingObjective          = 24,
	TimeInGame                     = 25,
	TimeJog                        = 26,
	TimeKitMenu                    = 27,
	TimeMoving                     = 28,
	TimeSpectating                 = 29,
	TimeDead                       = 30,
	LastPlayerFloatStat            = 31,
	MAX                            = 32,

};

// Enum Insurgency.EStatisticsPlayerStats
enum class EStatisticsPlayerStats : uint8_t
{
	FirstPlayerStat                = 0,
	Kills                          = 1,
	KillsFriendly                  = 2,
	Deaths                         = 3,
	Assists                        = 4,
	Headshots                      = 5,
	ShotsFired                     = 6,
	ShotsHit                       = 7,
	Dominations                    = 8,
	Saviors                        = 9,
	Revenges                       = 10,
	TargetsStunned                 = 11,
	TargetsSuppressed              = 12,
	AirSupportKills                = 13,
	AirSupportDeaths               = 14,
	SupportUsed                    = 15,
	RadioUsed                      = 16,
	SupplyDropKills                = 17,
	SupplyDropUsed                 = 18,
	SupportDenials                 = 19,
	KillsA10                       = 20,
	KillsApache                    = 21,
	KillsArtillery                 = 22,
	KillsBlackhawk                 = 23,
	KillsChemicalMortar            = 24,
	KillsGrenadeDrone              = 25,
	KillsIEDDrone                  = 26,
	KillsRocketBarrage             = 27,
	KillsAssault                   = 28,
	KillsLMG                       = 29,
	KillsBoltRifle                 = 30,
	KillsMarksmanRifle             = 31,
	KillsCarbine                   = 32,
	KillsShotgun                   = 33,
	KillsSMG                       = 34,
	KillsPistol                    = 35,
	KillsLauncher                  = 36,
	KillsMelee                     = 37,
	KillsShortRange                = 38,
	KillsMediumRange               = 39,
	KillsLongRange                 = 40,
	MunitionKills                  = 41,
	MunitionsUsed                  = 42,
	KillsGrenadeFrag               = 43,
	KillsGrenadeIncendiary         = 44,
	KillsOtherExplosive            = 45,
	KillsAiming                    = 46,
	KillsCrouching                 = 47,
	KillsFocused                   = 48,
	KillsHipped                    = 49,
	KillsProning                   = 50,
	KillsDefensive                 = 51,
	KillsOffensive                 = 52,
	KillsBipod                     = 53,
	KillsScoped                    = 54,
	KillsOptics                    = 55,
	KillsSights                    = 56,
	KillsStanding                  = 57,
	KillsIronSights                = 58,
	ObjectiveCaptureTicks          = 59,
	Objectives                     = 60,
	ObjectivesCaptured             = 61,
	ObjectivesDestroyed            = 62,
	ObjectivesNeutralized          = 63,
	ObjectivesReset                = 64,
	ObjectsDestroyed               = 65,
	ObstaclesDestroyed             = 66,
	PlayersRespawned               = 67,
	RegroupsTotal                  = 68,
	FlagDrops                      = 69,
	FlagPickups                    = 70,
	HeroCaps                       = 71,
	VehiclesDriven                 = 72,
	VehiclesDestroyed              = 73,
	VehicleAssists                 = 74,
	AirVehiclesDestroyed           = 75,
	AirVehicleAssists              = 76,
	ObjectAssists                  = 77,
	KillsPassenger                 = 78,
	KillsGunner                    = 79,
	KillsDriver                    = 80,
	DeathsPassenger                = 81,
	DeathsGunner                   = 82,
	DeathsDriver                   = 83,
	VehicleDeaths                  = 84,
	LastPlayerStat                 = 85,
	MAX                            = 86,

};

// Enum Insurgency.EStatisticsWeaponFloatStats
enum class EStatisticsWeaponFloatStats : uint8_t
{
	FirstWeaponFloatStat           = 0,
	DistanceCrouchWalk             = 1,
	DistanceDriver                 = 2,
	DistanceGunner                 = 3,
	DistancePassenger              = 4,
	DistanceProneCrawl             = 5,
	DistanceSlide                  = 6,
	DistanceSprint                 = 7,
	DistanceTraveled               = 8,
	DistanceWalk                   = 9,
	DistanceLean                   = 10,
	TimeCrouch                     = 11,
	TimeDriver                     = 12,
	TimeGunner                     = 13,
	TimePassenger                  = 14,
	TimeProne                      = 15,
	TimeSlide                      = 16,
	TimeSprint                     = 17,
	TimeWalk                       = 18,
	TimeLean                       = 19,
	TimePlayed                     = 20,
	LastWeaponFloatStat            = 21,
	MAX                            = 22,

};

// Enum Insurgency.EStatisticsWeaponStats
enum class EStatisticsWeaponStats : uint8_t
{
	FirstWeaponStat                = 0,
	Shots                          = 1,
	Hits                           = 2,
	Kills                          = 3,
	KillsHeadshot                  = 4,
	KillsFriendly                  = 5,
	KillsOffensive                 = 6,
	KillsDefensive                 = 7,
	Assists                        = 8,
	Deaths                         = 9,
	TargetsSuppressed              = 10,
	KillsBipod                     = 11,
	KillsFocused                   = 12,
	KillsAiming                    = 13,
	KillsStanding                  = 14,
	KillsProning                   = 15,
	KillsCrouching                 = 16,
	KillsScoped                    = 17,
	KillsSights                    = 18,
	KillsOptics                    = 19,
	KillsHipped                    = 20,
	KillsIronSights                = 21,
	KillsShortRange                = 22,
	KillsMediumRange               = 23,
	KillsLongRange                 = 24,
	VehiclesDestroyed              = 25,
	VehicleAssists                 = 26,
	AirVehiclesDestroyed           = 27,
	AirVehicleAssists              = 28,
	ObjectsDestroyed               = 29,
	ObjectAssists                  = 30,
	KillsPassenger                 = 31,
	KillsGunner                    = 32,
	LastWeaponStat                 = 33,
	MAX                            = 34,

};

// Enum Insurgency.EStatisticsGameTypes
enum class EStatisticsGameTypes : uint8_t
{
	Unranked                       = 0,
	PVP                            = 1,
	Coop                           = 2,
	CompetitiveMatchmaking         = 3,
	CompetitiveLadder              = 4,
	PVPMatchmaking                 = 5,
	CoopMatchmaking                = 6,
	MAX                            = 7,

};

// Enum Insurgency.EStatisticsGameErrorCodes
enum class EStatisticsGameErrorCodes : uint8_t
{
	NoError                        = 0,
	NeedsLogin                     = 1,
	DatabaseError                  = 2,
	InvalidPlaylist                = 3,
	InvalidGameId                  = 4,
	MAX                            = 5,

};

// Enum Insurgency.EStructureElementType
enum class EStructureElementType : uint8_t
{
	Floor                          = 0,
	Wall                           = 1,
	MAX                            = 2,

};

// Enum Insurgency.EDecalTransformMask
enum class EDecalTransformMask : uint8_t
{
	SRDT_None                      = 0,
	SRDT_RandomRotate              = 1,
	SRDT_UseParallax               = 2,
	SRDT_MirrorHorizontal          = 3,
	SRDT_MAX                       = 4,

};

// Enum Insurgency.ESurvivalOrderType
enum class ESurvivalOrderType : uint8_t
{
	Standard                       = 0,
	CandidateForInitial            = 1,
	CandidateForPenultimate        = 2,
	Extraction                     = 3,
	MAX                            = 4,

};

// Enum Insurgency.ETacticalGridDebugDisplayMode
enum class ETacticalGridDebugDisplayMode : uint8_t
{
	Boxes                          = 0,
	Lines                          = 1,
	MAX                            = 2,

};

// Enum Insurgency.ETacticalGridDebugMode
enum class ETacticalGridDebugMode : uint8_t
{
	VisibilityToPoint              = 0,
	VisibilityFromPoint            = 1,
	MAX                            = 2,

};

// Enum Insurgency.ETaglineEvaluation
enum class ETaglineEvaluation : uint8_t
{
	Equal                          = 0,
	GreaterThan                    = 1,
	LessThan                       = 2,
	GreaterThanEq                  = 3,
	LessThanEq                     = 4,
	MAX                            = 5,

};

// Enum Insurgency.ETaglineStatType
enum class ETaglineStatType : uint8_t
{
	Invalid                        = 0,
	Int32                          = 1,
	Float                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.ETeamRelationship
enum class ETeamRelationship : uint8_t
{
	Neutral                        = 0,
	Friendly                       = 1,
	Enemy                          = 2,
	MAX                            = 3,

};

// Enum Insurgency.ELessonCategory
enum class ELessonCategory : uint8_t
{
	None                           = 0,
	Objectives                     = 1,
	Movement                       = 2,
	Weapons                        = 3,
	WorldInteraction               = 4,
	Vehicles                       = 5,
	Strategy                       = 6,
	FireSupport                    = 7,
	MAX                            = 8,

};

// Enum Insurgency.ETutorialStage
enum class ETutorialStage : uint8_t
{
	Movement                       = 0,
	Crouch                         = 1,
	Weapon                         = 2,
	FirstKill                      = 3,
	Vault                          = 4,
	GrenadePickup                  = 5,
	Grenade                        = 6,
	ClearBuilding                  = 7,
	Resupply                       = 8,
	FirstCapture                   = 9,
	SecondCapture                  = 10,
	ResupplyAfterCap               = 11,
	DestroyStart                   = 12,
	Completed                      = 13,
	Invalid                        = 14,
	MAX                            = 15,

};

// Enum Insurgency.EUseHoldBehavior
enum class EUseHoldBehavior : uint8_t
{
	NoWeaponLower                  = 0,
	WeaponLower                    = 1,
	InterruptReload                = 2,
	MAX                            = 3,

};

// Enum Insurgency.EUseResponse
enum class EUseResponse : uint8_t
{
	Ignore                         = 0,
	Handled                        = 1,
	HandledServer                  = 2,
	MAX                            = 3,

};

// Enum Insurgency.EHoverVehicleDamageState
enum class EHoverVehicleDamageState : uint8_t
{
	DamageState_Alive              = 0,
	DamageState_Falling            = 1,
	DamageState_Falling_Spinning   = 2,
	DamageState_Destroyed          = 3,
	DamageState_MAX                = 4,

};

// Enum Insurgency.EHoverVehicleMovement
enum class EHoverVehicleMovement : uint8_t
{
	HoverMovement_None             = 0,
	HoverMovement_Ascend           = 1,
	HoverMovement_Descend          = 2,
	HoverMovement_Max              = 3,

};

// Enum Insurgency.ESeatDeathMechanic
enum class ESeatDeathMechanic : uint8_t
{
	Death_Swerving                 = 0,
	Death_Accelerating             = 1,
	Death_Brake                    = 2,
	Death_None                     = 3,
	Death_MAX                      = 4,

};

// Enum Insurgency.ESeatCameraType
enum class ESeatCameraType : uint8_t
{
	Cam_FirstPerson                = 0,
	MAX_CAMERA_TYPES               = 1,
	MAX                            = 2,

};

// Enum Insurgency.ESeatRotationType
enum class ESeatRotationType : uint8_t
{
	Rotation_UseSeatComponent      = 0,
	Rotation_Freelook              = 1,
	Rotation_Turret                = 2,
	Rotation_MAX                   = 3,

};

// Enum Insurgency.ESeatTypeEnum
enum class ESeatTypeEnum : uint8_t
{
	Seat_Driver                    = 0,
	Seat_Passenger                 = 1,
	Seat_PassengerGunner           = 2,
	Seat_Turret                    = 3,
	Seat_Any                       = 4,
	Seat_MAX                       = 5,

};

// Enum Insurgency.EWeaponLightMode
enum class EWeaponLightMode : uint8_t
{
	Off                            = 0,
	Flashlight                     = 1,
	Laser                          = 2,
	IR                             = 3,
	Count                          = 4,
	MAX                            = 5,

};

// Enum Insurgency.EKeyBindingType
enum class EKeyBindingType : uint8_t
{
	Normal                         = 0,
	Hold                           = 1,
	Toggle                         = 2,
	MAX                            = 3,

};

// Enum Insurgency.ESeatSearchPriorityType
enum class ESeatSearchPriorityType : uint8_t
{
	Priority_Closest               = 0,
	Priority_Ranking               = 1,
	Priority_MAX                   = 2,

};

// Enum Insurgency.EVehicleOrientation
enum class EVehicleOrientation : uint8_t
{
	Vehicle_Falling                = 0,
	Vehicle_Upright                = 1,
	Vehicle_OnSide                 = 2,
	Vehicle_UpsideDown             = 3,
	Vehicle_MAX                    = 4,

};

// Enum Insurgency.EAttachmentFallbackMode
enum class EAttachmentFallbackMode : uint8_t
{
	AlwaysShow                     = 0,
	Or                             = 1,
	And                            = 2,
	Xor                            = 3,
	Nor                            = 4,
	Nand                           = 5,
	Xnor                           = 6,
	MAX                            = 7,

};

// Enum Insurgency.EUpgradeTagMatchCondition
enum class EUpgradeTagMatchCondition : uint8_t
{
	NoMatchingTag                  = 0,
	HasAllTags                     = 1,
	HasAnyTag                      = 2,
	MAX                            = 3,

};

// Enum Insurgency.EFirearmBoltState
enum class EFirearmBoltState : uint8_t
{
	Ready                          = 0,
	NeedCycling                    = 1,
	Cycling                        = 2,
	MAX                            = 3,

};

// Enum Insurgency.EFirearmState
enum class EFirearmState : uint8_t
{
	Idle                           = 0,
	Firing                         = 1,
	CyclingFiremode                = 2,
	ReloadingDry                   = 3,
	ReloadingTactical              = 4,
	ReloadingDrySpeed              = 5,
	ReloadingTacticalSpeed         = 6,
	ReloadingDryStart              = 7,
	ReloadingTacticalStart         = 8,
	ReloadingLoop                  = 9,
	FinishingSingleReload          = 10,
	FinishingReload                = 11,
	CyclingBolt                    = 12,
	AmmoCheck                      = 13,
	MAX                            = 14,

};

// Enum Insurgency.EWeaponUpgradeSlot
enum class EWeaponUpgradeSlot : uint8_t
{
	Invalid                        = 0,
	Optics                         = 1,
	Chamber                        = 2,
	Underbarrel                    = 3,
	UnderbarrelHiddenBonus         = 4,
	Barrel                         = 5,
	Magazine                       = 6,
	Siderail                       = 7,
	Ammo                           = 8,
	Stock                          = 9,
	Training                       = 10,
	Aesthetic                      = 11,
	Misc                           = 12,
	Count                          = 13,
	MAX                            = 14,

};

// Enum Insurgency.EItemSlot
enum class EItemSlot : uint8_t
{
	None                           = 0,
	Primary                        = 1,
	Secondary                      = 2,
	Explosive                      = 3,
	FireSupport                    = 4,
	Miscellaneous                  = 5,
	Vest                           = 6,
	AmmoCarrier                    = 7,
	Armor                          = 8,
	Head                           = 9,
	Accessory                      = 10,
	Melee                          = 11,
	Backpack                       = 12,
	GearMisc1                      = 13,
	GearMisc2                      = 14,
	Cinematic                      = 15,
	Count                          = 16,
	MAX                            = 17,

};

// Enum Insurgency.EEquipableState
enum class EEquipableState : uint8_t
{
	ES_Unequipped                  = 0,
	ES_Equipping                   = 1,
	ES_Equipped                    = 2,
	ES_Unequipping                 = 3,
	ES_Transitioning               = 4,
	ES_MAX                         = 5,

};

// Enum Insurgency.EIKDirection
enum class EIKDirection : uint8_t
{
	Left                           = 0,
	Right                          = 1,
	Both                           = 2,
	None                           = 3,
	MAX                            = 4,

};

// Enum Insurgency.EUsablePriority
enum class EUsablePriority : uint8_t
{
	Low                            = 0,
	Normal                         = 1,
	High                           = 2,
	MAX                            = 3,

};

// Enum Insurgency.EAIControllerState
enum class EAIControllerState : uint8_t
{
	AIS_IDLE                       = 0,
	AIS_COMBAT                     = 1,
	AIS_NOSTATE                    = 2,
	MAX_STATES                     = 3,
	MAX                            = 4,

};

//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// ScriptStruct Insurgency.CharacterFireSupportIncomingPhrase
// 0x0020
struct FCharacterFireSupportIncomingPhrase
{
	class UFireSupportDefinition*                      AssociatedFireSupport;                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               EnemyIncomingEvent;                                        // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               FriendlyIncomingEvent;                                     // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bEnemySpecifyVariations;                                   // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      EnemyNumVariations;                                        // 0x0019(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFriendlySpecifyVariations;                                // 0x001A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FriendlyNumVariations;                                     // 0x001B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9H8X[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.CharacterFireSupportObserverPhrase
// 0x0020
struct FCharacterFireSupportObserverPhrase
{
	class UFireSupportDefinition*                      AssociatedFireSupport;                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               RequestEvent;                                              // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               ThankEvent;                                                // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bRequestSpecifyVariations;                                 // 0x0018(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      RequestNumVariations;                                      // 0x0019(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bThankSpecifyVariations;                                   // 0x001A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ThankNumVariations;                                        // 0x001B(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_3JLH[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.CharacterFireSupportOfficerPhrase
// 0x0018
struct FCharacterFireSupportOfficerPhrase
{
	class UFireSupportDefinition*                      AssociatedFireSupport;                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               Event;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSpecifyVariations;                                        // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      NumVariations;                                             // 0x0011(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RS9A[0x6];                                     // 0x0012(0x0006) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.CharacterPhrase
// 0x0018
struct FCharacterPhrase
{
	ECharacterResponse                                 AssociatedResponse;                                        // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7YGG[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAkAudioEvent*                               Event;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSpecifyVariations;                                        // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      NumVariations;                                             // 0x0011(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_UN8W[0x6];                                     // 0x0012(0x0006) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.CharacterMutedPhrase
// 0x0008
struct FCharacterMutedPhrase
{
	ECharacterResponse                                 AssociatedResponse;                                        // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_XZMZ[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              AllowPlayTimestamp;                                        // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.FirearmAIConfig
// 0x0028
struct FFirearmAIConfig
{
	float                                              MaxDistance;                                               // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinAttackDegrees;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinAttackDegreesClose;                                     // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxAttackDegrees;                                          // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ProjectileSpreadZeroTimeFar;                               // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ProjectileSpreadZeroTimeClose;                             // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   BloatBoxMin;                                               // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                                   BloatBoxMax;                                               // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.BotGrenadeCheckResult
// 0x0020
struct FBotGrenadeCheckResult
{
	unsigned char                                      UnknownData_N0Y7[0x20];                                    // 0x0000(0x0020) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.BloodSplatter
// 0x0030
struct FBloodSplatter
{
	struct FVector                                     MinSize;                                                   // 0x0000(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     MaxSize;                                                   // 0x000C(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>                  Materials;                                                 // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bRandomizeYaw;                                             // 0x0028(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_PQPX[0x7];                                     // 0x0029(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.BoneDamageMod
// 0x0008
struct FBoneDamageMod
{
	float                                              DamageMod;                                                 // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              VelocityMod;                                               // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.AIINSNoiseEvent
// 0x0030
struct FAIINSNoiseEvent
{
	unsigned char                                      UnknownData_C4HX[0x4];                                     // 0x0000(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     NoiseLocation;                                             // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Loudness;                                                  // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxRange;                                                  // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      Instigator;                                                // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Tag;                                                       // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_OMWW[0x8];                                     // 0x0028(0x0008) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.AircraftPayload
// 0x0038
struct FAircraftPayload
{
	class UClass*                                      PayloadProjectileClass;                                    // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      PayloadActorClass;                                         // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Number;                                                    // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InitialDropDelay;                                          // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              TimeBetweenDrops;                                          // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JMM8[0x4];                                     // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAkAudioEvent*                               AudioEventTrigger;                                         // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9C4Z[0x10];                                    // 0x0028(0x0010) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ScoreboardConfig
// 0x0028
struct FScoreboardConfig
{
	bool                                               bDisplayRoundsWon;                                         // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisplayTeamScore;                                         // 0x0001(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisplayTeamPoints;                                        // 0x0002(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_933K[0x5];                                     // 0x0003(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       PointsText;                                                // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                               bDisplayPlayerScore;                                       // 0x0020(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisplayPlayerKAD;                                         // 0x0021(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisplayPlayerObjectives;                                  // 0x0022(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAlwaysShowExtendedInfo;                                   // 0x0023(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisplayObjectiveBriefing;                                 // 0x0024(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WLEZ[0x3];                                     // 0x0025(0x0003) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.CharacterResponseRequest
// 0x0040
struct FCharacterResponseRequest
{
	ECharacterResponse                                 ResponseLine;                                              // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bStopPrevious;                                             // 0x0001(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bQueued;                                                   // 0x0002(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bTeamOnly;                                                 // 0x0003(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bNeedsTeammatesNearby;                                     // 0x0004(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_3FTE[0x3];                                     // 0x0005(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              RepeatThreshold;                                           // 0x0008(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bOncePerSquad;                                             // 0x000C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisableInCoopForEnemies;                                  // 0x000D(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_NSFD[0x2];                                     // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UFireSupportDefinition*                      AssociatedFireSupport;                                     // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       SubtitleText;                                              // 0x0018(0x0018) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	unsigned char                                      AssociatedObjectiveId;                                     // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0M8X[0x3];                                     // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TWeakObjectPtr<class AINSSoldier>                  TargetSoldier;                                             // 0x0034(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_07NL[0x4];                                     // 0x003C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ServerCustomWelcome
// 0x0090
struct FServerCustomWelcome
{
	struct FString                                     ScenarioName;                                              // 0x0000(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       ScenarioLighting;                                          // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ServerHostname;                                            // 0x0018(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       MOTDText;                                                  // 0x0028(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	unsigned char                                      ActiveMods[0x50];                                          // 0x0040(0x0050) UNKNOWN PROPERTY: SetProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ClientNetStats
// 0x002C
struct FClientNetStats
{
	float                                              Ping;                                                      // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AvgPing;                                                   // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AvgJitter;                                                 // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                InBytesPerSecond;                                          // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                OutBytesPerSecond;                                         // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                InPacketsPerSecond;                                        // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                OutPacketsPerSecond;                                       // 0x0018(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InPacketLossPercent;                                       // 0x001C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InAvgPacketLossPercent;                                    // 0x0020(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              OutPacketLossPercent;                                      // 0x0024(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              OutAvgPacketLossPercent;                                   // 0x0028(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.AvailablePlaylists
// 0x0058
struct FAvailablePlaylists
{
	EAvailablePlaylistState                            State;                                                     // 0x0000(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_L7E7[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<class UPlaylist*, struct FQueryOpenPoolsResultsEntry> Playlists;                                                 // 0x0008(0x0050) (Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.BlueprintFindSessionResult
// 0x00B8
struct FBlueprintFindSessionResult
{
	unsigned char                                      UnknownData_7RHS[0xB8];                                    // 0x0000(0x00B8) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.FireSupportState
// 0x0028
struct FFireSupportState
{
	int                                                MaxUses;                                                   // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NumUses;                                                   // 0x0004(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BeginLockedTimestamp;                                      // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FinishLockedTimestamp;                                     // 0x000C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RoundStartDelay;                                           // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6JMN[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UFireSupportDefinition*                      FireSupportDefinition;                                     // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDisabled;                                                 // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZK66[0x7];                                     // 0x0021(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ReplicatedTeamSettings
// 0x000C
struct FReplicatedTeamSettings
{
	float                                              WaveDeadPlayerRatio;                                       // 0x0000(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              WaveMaxWaitTime;                                           // 0x0004(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              WaveRespawnDelay;                                          // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.FireSupportGameModeOverrideDefinition
// 0x0010
struct FFireSupportGameModeOverrideDefinition
{
	bool                                               bEnabled;                                                  // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_1HHJ[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                MaximumUsesPerRound;                                       // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseRoundStartDelayOverride;                               // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_LL42[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              RoundStartDelay;                                           // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.PlayerKillNotice
// 0x0038
struct FPlayerKillNotice
{
	class AINSPlayerState*                             Killer;                                                    // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AINSPlayerState*                             Assister;                                                  // 0x0008(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AINSPlayerState*                             Victim;                                                    // 0x0010(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      CauserClass;                                               // 0x0018(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      WeaponClass;                                               // 0x0020(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      DamageTypeClass;                                           // 0x0028(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Distance;                                                  // 0x0030(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHeadshot;                                                 // 0x0034(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IYME[0x3];                                     // 0x0035(0x0003) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.NetHitReaction
// 0x0040
struct FNetHitReaction
{
	class USurfaceReaction*                            Reaction;                                                  // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantize10                       Location;                                                  // 0x0008(0x000C) (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector_NetQuantizeNormal                   Direction;                                                 // 0x0014(0x000C) (BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       Bone;                                                      // 0x0020(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHitArmor;                                                 // 0x0028(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bVehicleArmour;                                            // 0x0029(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bKillEffect;                                               // 0x002A(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GOSP[0x5];                                     // 0x002B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FDamageEvent                                DamageEvent;                                               // 0x0030(0x0010) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.MenuExternalLight
// 0x0010
struct FMenuExternalLight
{
	class ALight*                                      LightActor;                                                // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              OriginalIntensity;                                         // 0x0008(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CVMG[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.SoundscapeStateEnvLevel
// 0x0030
struct FSoundscapeStateEnvLevel
{
	unsigned char                                      Event[0x28];                                               // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	float                                              Level;                                                     // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_4Y3D[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.SoundscapeStateAuxLevel
// 0x0030
struct FSoundscapeStateAuxLevel
{
	unsigned char                                      Bus[0x28];                                                 // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	float                                              Level;                                                     // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9KSJ[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.SoundscapeStateRepl
// 0x01C0
struct FSoundscapeStateRepl
{
	struct FSoundscapeStateEnvLevel                    EnvironmentEvents[0x5];                                    // 0x0000(0x00F0) (NativeAccessSpecifierPublic)
	struct FSoundscapeStateAuxLevel                    AuxBusLevels[0x4];                                         // 0x00F0(0x00C0) (NativeAccessSpecifierPublic)
	struct FName                                       WeaponSwitch;                                              // 0x01B0(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESoundscapeVehicleState                            VehicleState;                                              // 0x01B8(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WUG1[0x7];                                     // 0x01B9(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.MeleeConfig
// 0x0040
struct FMeleeConfig
{
	float                                              Delay;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Range;                                                     // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StaminaCost;                                               // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDamageAffectedByStamina;                                  // 0x000C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8PRD[0x3];                                     // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              DamageFront;                                               // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageBack;                                                // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              YawRange;                                                  // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              PitchRange;                                                // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      DamageTypeClass;                                           // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SwingTime;                                                 // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RecoveryTime;                                              // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeleeSwingDirection                               StartDirection;                                            // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMeleeSwingDirection                               EndDirection;                                              // 0x0031(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EUPT[0x6];                                     // 0x0032(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class USurfaceReaction*                            SurfaceReaction;                                           // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.GameStatsSummary
// 0x0050
struct FGameStatsSummary
{
	bool                                               bPopulated;                                                // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6E40[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       PreferredClassKey;                                         // 0x0004(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2O8H[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      PreferredWeapon[0x28];                                     // 0x0010(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	int                                                Kills;                                                     // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Deaths;                                                    // 0x003C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Assists;                                                   // 0x0040(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ObjectivesSecured;                                         // 0x0044(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ObjectiveTimeSeconds;                                      // 0x0048(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IWWM[0x4];                                     // 0x004C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.PlayerRoundOverData
// 0x00B8
struct FPlayerRoundOverData
{
	bool                                               bPopulated;                                                // 0x0000(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_80QC[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FText                                       CategoryName;                                              // 0x0008(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       GameModeName;                                              // 0x0020(0x0018) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	int                                                RoundNumber;                                               // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Team0Score;                                                // 0x003C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Team1Score;                                                // 0x0040(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERoundConclusion                                   RoundEndReason;                                            // 0x0044(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      WinningTeam;                                               // 0x0045(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_OYTX[0x2];                                     // 0x0046(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                RoundLengthSec;                                            // 0x0048(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WV9Z[0x4];                                     // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FOtherPlayerAwardedTagline>          Taglines;                                                  // 0x0050(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameStatsSummary                           RoundStats;                                                // 0x0060(0x0050) (BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	float                                              SecUntilStateChange;                                       // 0x00B0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAtWinConditions;                                          // 0x00B4(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_A0U0[0x3];                                     // 0x00B5(0x0003) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.PlayerAwardedTagline
// 0x0018
struct FPlayerAwardedTagline
{
	class UClass*                                      Tagline;                                                   // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETaglineContextType                                ContextValueType;                                          // 0x0008(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JUOJ[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                ContextValueInt;                                           // 0x000C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ContextValueFloat;                                         // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CalculatedCoolness;                                        // 0x0014(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.OtherPlayerAwardedTagline
// 0x0008 (0x0020 - 0x0018)
struct FOtherPlayerAwardedTagline : public FPlayerAwardedTagline
{
	class AINSPlayerState*                             PlayerState;                                               // 0x0018(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ReloadTimes
// 0x0038
struct FReloadTimes
{
	float                                              Sequence;                                                  // 0x0000(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Insert;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InsertSequence;                                            // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Eject;                                                     // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Chamber;                                                   // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Start;                                                     // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartEject;                                                // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StartChamber;                                              // 0x001C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              StagedStart;                                               // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InsertLoop;                                                // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              InsertLoopSequence;                                        // 0x0028(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              End;                                                       // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              EndReady;                                                  // 0x0030(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CheckPendingAmmo;                                          // 0x0034(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ReloadTimesGroup
// 0x00E0
struct FReloadTimesGroup
{
	struct FReloadTimes                                Tactical;                                                  // 0x0000(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FReloadTimes                                TacticalSpeed;                                             // 0x0038(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FReloadTimes                                Dry;                                                       // 0x0070(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FReloadTimes                                DrySpeed;                                                  // 0x00A8(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.AttachedModel
// 0x0038
struct FAttachedModel
{
	unsigned char                                      SkeletalMesh[0x28];                                        // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	struct FName                                       ParentSocket;                                              // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bSetMasterPoseComponent;                                   // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IRUQ[0x3];                                     // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Scale;                                                     // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WeaponAttachedModel
// 0x0008 (0x0040 - 0x0038)
struct FWeaponAttachedModel : public FAttachedModel
{
	class UINSSkeletalMeshComponent*                   SpawnedSkeletalComponent;                                  // 0x0038(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WeaponFallbackModel
// 0x0070 (0x00B0 - 0x0040)
struct FWeaponFallbackModel : public FWeaponAttachedModel
{
	bool                                               bMatchTags;                                                // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZVLH[0x7];                                     // 0x0041(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FWeaponTagCondition>                 TagConditions;                                             // 0x0048(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                UpgradeSlotMask;                                           // 0x0058(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentFallbackMode                            FallbackMode;                                              // 0x005C(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bVisibleWhenAttached;                                      // 0x005D(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bVisibleWhenNotAttached;                                   // 0x005E(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_GIH7[0x1];                                     // 0x005F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      IgnoredUpgrades[0x50];                                     // 0x0060(0x0050) UNKNOWN PROPERTY: SetProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WeaponTagCondition
// 0x0058
struct FWeaponTagCondition
{
	unsigned char                                      Tags[0x50];                                                // 0x0000(0x0050) UNKNOWN PROPERTY: SetProperty
	EUpgradeTagMatchCondition                          Condition;                                                 // 0x0050(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7K59[0x7];                                     // 0x0051(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.VehicleAnimationStruct
// 0x0028
struct FVehicleAnimationStruct
{
	class UAnimSequence*                               Idle;                                                      // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               Running;                                                   // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               GearShift;                                                 // 0x0010(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               WheelTurn;                                                 // 0x0018(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               Fire;                                                      // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.CharacterCollisionPrevention
// 0x0010
struct FCharacterCollisionPrevention
{
	TWeakObjectPtr<class AINSCharacter>                IgnoredCharacter;                                          // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MULT[0x8];                                     // 0x0008(0x0008) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.KeyBindingSection
// 0x0028
struct FKeyBindingSection
{
	struct FText                                       SectionName;                                               // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TArray<struct FKeyBindingOption>                   Options;                                                   // 0x0018(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.KeyBindingOption
// 0x0130
struct FKeyBindingOption
{
	struct FText                                       BindingName;                                               // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FText                                       BindingDescription;                                        // 0x0018(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	EKeyBindingType                                    BindingType;                                               // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7ABI[0x3];                                     // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       ActionMapping;                                             // 0x0034(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIsAxisMapping;                                            // 0x003C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BBOD[0x3];                                     // 0x003D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              AxisScaling;                                               // 0x0040(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2OA9[0x4];                                     // 0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FInputChord                                 DefaultKey;                                                // 0x0048(0x0020) (BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FInputChord                                 BoundKey;                                                  // 0x0068(0x0020) (BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bBoundKeyDirty;                                            // 0x0088(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JXAH[0x7];                                     // 0x0089(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      AllowedSameKeyActions[0x50];                               // 0x0090(0x0050) UNKNOWN PROPERTY: SetProperty
	unsigned char                                      KeyGroups[0x50];                                           // 0x00E0(0x0050) UNKNOWN PROPERTY: SetProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ActionMapList
// 0x0010
struct FActionMapList
{
	TArray<struct FInputChord>                         InputChords;                                               // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.MotdUpdateMessage
// 0x0068
struct FMotdUpdateMessage
{
	struct FText                                       Title;                                                     // 0x0000(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FString                                     ImageUrl;                                                  // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       Message;                                                   // 0x0028(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FString                                     LinkUrl;                                                   // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       LinkText;                                                  // 0x0050(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.MotdData
// 0x0168
struct FMotdData
{
	bool                                               bSucceeded;                                                // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_SW5S[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                HttpResponseCode;                                          // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       Title;                                                     // 0x0008(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FDateTime                                   PublishTime;                                               // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       Body;                                                      // 0x0028(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FString                                     ImageUrl;                                                  // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             Images;                                                    // 0x0050(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     ExternalLink;                                              // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       LinkButtonText;                                            // 0x0070(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                               bHasUpdateMessage;                                         // 0x0088(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DJK2[0x7];                                     // 0x0089(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FMotdUpdateMessage                          UpdateMessage;                                             // 0x0090(0x0068) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                               bHasFreeUserUpdateMessage;                                 // 0x00F8(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EWOM[0x7];                                     // 0x00F9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FMotdUpdateMessage                          FreeWeekendUpdateMessage;                                  // 0x0100(0x0068) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WeaponSightSequence
// 0x0038
struct FWeaponSightSequence
{
	unsigned char                                      Weapon[0x28];                                              // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	class UAnimSequence*                               SightsDelta;                                               // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ViewModelSightDistance;                                    // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ViewModelRotation;                                         // 0x0034(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WeaponUpgradeModel
// 0x0018 (0x0058 - 0x0040)
struct FWeaponUpgradeModel : public FWeaponAttachedModel
{
	unsigned char                                      WeaponFilter[0x10];                                        // 0x0040(0x0010) UNKNOWN PROPERTY: ArrayProperty
	bool                                               bCanBePrimaryModel;                                        // 0x0050(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0FV9[0x7];                                     // 0x0051(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.AnimSequenceRandom
// 0x0030
struct FAnimSequenceRandom
{
	unsigned char                                      SequenceAssetPtrs[0x10];                                   // 0x0000(0x0010) UNKNOWN PROPERTY: ArrayProperty
	TArray<class UAnimSequence*>                       Sequences;                                                 // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRandomSequencePair>                 RemainingRandomSequences;                                  // 0x0020(0x0010) (ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.FireSelectGroup
// 0x0120
struct FFireSelectGroup
{
	unsigned char                                      FireSelectAutoBurstAsset[0x28];                            // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireSelectAutoBurst;                                       // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FireSelectAutoSemiAsset[0x28];                             // 0x0030(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireSelectAutoSemi;                                        // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FireSelectBurstAutoAsset[0x28];                            // 0x0060(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireSelectBurstAuto;                                       // 0x0088(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FireSelectBurstSemiAsset[0x28];                            // 0x0090(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireSelectBurstSemi;                                       // 0x00B8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FireSelectSemiAutoAsset[0x28];                             // 0x00C0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireSelectSemiAuto;                                        // 0x00E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FireSelectSemiBurstAsset[0x28];                            // 0x00F0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireSelectSemiBurst;                                       // 0x0118(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.FirearmAnimsGroup
// 0x0DE0
struct FFirearmAnimsGroup
{
	struct FAnimSequenceRandom                         FireRecoil;                                                // 0x0000(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class UClass*, struct FAnimSequenceRandom>    FireRecoilMap;                                             // 0x0030(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         DeployedFireRecoil;                                        // 0x0080(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class UClass*, struct FAnimSequenceRandom>    DeployedFireRecoilMap;                                     // 0x00B0(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                              RecoilAdjustment;                                          // 0x0100(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6ZRX[0x4];                                     // 0x0104(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimSequenceRandom                         FireRecoilIron;                                            // 0x0108(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class UClass*, struct FAnimSequenceRandom>    FireRecoilIronMap;                                         // 0x0138(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         DeployedFireRecoilIron;                                    // 0x0188(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class UClass*, struct FAnimSequenceRandom>    DeployedFireRecoilIronMap;                                 // 0x01B8(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                              RecoilIronAdjustment;                                      // 0x0208(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_V8CT[0x4];                                     // 0x020C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimSequenceRandom                         FireRecoilLoop;                                            // 0x0210(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class UClass*, class UAnimSequence*>          AmmoDeltaMap;                                              // 0x0240(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      FirePinAsset[0x28];                                        // 0x0290(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FirePin;                                                   // 0x02B8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FireTriggerAsset[0x28];                                    // 0x02C0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireTrigger;                                               // 0x02E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FireBoltAsset[0x28];                                       // 0x02F0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireBolt;                                                  // 0x0318(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      FireBoltLastAsset[0x28];                                   // 0x0320(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               FireBoltLast;                                              // 0x0348(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         BoltCycle;                                                 // 0x0350(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         DeployedBoltCycle;                                         // 0x0380(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         Regrip;                                                    // 0x03B0(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      DryfireAsset[0x28];                                        // 0x03E0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Dryfire;                                                   // 0x0408(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      DryfireIronAsset[0x28];                                    // 0x0410(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               DryfireIron;                                               // 0x0438(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         BoltCycleIron;                                             // 0x0440(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         DeployedBoltCycleIron;                                     // 0x0470(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFireSelectGroup                            FireSelects;                                               // 0x04A0(0x0120) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFireSelectGroup                            FireSelectsIron;                                           // 0x05C0(0x0120) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFireSelectGroup                            DeployedFireSelects;                                       // 0x06E0(0x0120) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFireSelectGroup                            DeployedFireSelectsIron;                                   // 0x0800(0x0120) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      UnderbarrelTransitionAsset[0x28];                          // 0x0920(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               UnderbarrelTransition;                                     // 0x0948(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      DeployedTransitionAsset[0x28];                             // 0x0950(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimMontage*                                DeployedTransition;                                        // 0x0978(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, class UAnimMontage*>           DeployedTransitionMap;                                     // 0x0980(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      DeployedIronTransitionAsset[0x28];                         // 0x09D0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimMontage*                                DeployedIronTransition;                                    // 0x09F8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, class UAnimMontage*>           DeployedIronTransitionMap;                                 // 0x0A00(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      SideMountOnOffAsset[0x28];                                 // 0x0A50(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimMontage*                                SideMountOnOff;                                            // 0x0A78(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      StockOpenCloseAsset[0x28];                                 // 0x0A80(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimMontage*                                StockOpenClose;                                            // 0x0AA8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      BipodOpenCloseAsset[0x28];                                 // 0x0AB0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimMontage*                                BipodOpenClose;                                            // 0x0AD8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, class UAnimMontage*>           BipodOpenCloseMap;                                         // 0x0AE0(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      OpticToggleMap[0x50];                                      // 0x0B30(0x0050) UNKNOWN PROPERTY: MapProperty
	unsigned char                                      ForegripDeltaMap[0x50];                                    // 0x0B80(0x0050) UNKNOWN PROPERTY: MapProperty
	unsigned char                                      BayonetPullbackAsset[0x28];                                // 0x0BD0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               BayonetPullback;                                           // 0x0BF8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FReloadGroup>                        Reloads;                                                   // 0x0C00(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, struct FReloadGroup>           AlternateReloads;                                          // 0x0C10(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FReloadGroup>                        SingleReloads;                                             // 0x0C60(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FReloadGroup>                        FastReloads;                                               // 0x0C70(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, struct FReloadGroup>           AlternateFastReloads;                                      // 0x0C80(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FReloadGroup>                        DeployedReloads;                                           // 0x0CD0(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, struct FReloadGroup>           AlternateDeployedReloads;                                  // 0x0CE0(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FReloadGroup>                        DeployedSingleReloads;                                     // 0x0D30(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FReloadGroup>                        DeployedFastReloads;                                       // 0x0D40(0x0010) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         AmmoChecks;                                                // 0x0D50(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         AmmoChecksIron;                                            // 0x0D80(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         DeployedAmmoChecks;                                        // 0x0DB0(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ReloadGroup
// 0x00C8
struct FReloadGroup
{
	float                                              Weight;                                                    // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_P4N6[0x4];                                     // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      ReloadAsset[0x28];                                         // 0x0008(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimMontage*                                Reload;                                                    // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ReloadEmptyAsset[0x28];                                    // 0x0038(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimMontage*                                ReloadEmpty;                                               // 0x0060(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ReloadStagesAsset[0x28];                                   // 0x0068(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimMontage*                                ReloadStages;                                              // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ReloadBoltReleaseAsset[0x28];                              // 0x0098(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               ReloadBoltRelease;                                         // 0x00C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.RandomSequencePair
// 0x0010
struct FRandomSequencePair
{
	class UAnimSequence*                               Sequence;                                                  // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Index;                                                     // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HF1M[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.BasicLoadoutItem
// 0x0038
struct FBasicLoadoutItem
{
	unsigned char                                      Item[0x28];                                                // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	unsigned char                                      Upgrades[0x10];                                            // 0x0028(0x0010) UNKNOWN PROPERTY: ArrayProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.LoadoutWeapon
// 0x0008 (0x0040 - 0x0038)
struct FLoadoutWeapon : public FBasicLoadoutItem
{
	bool                                               bLockSlot;                                                 // 0x0038(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_OEHI[0x7];                                     // 0x0039(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ExplosiveDamageParams
// 0x0080
struct FExplosiveDamageParams
{
	class AController*                                 Instigator;                                                // 0x0000(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                      Inflictor;                                                 // 0x0008(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                       Damager;                                                   // 0x0010(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                              IgnoredActors;                                             // 0x0018(0x0010) (BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Origin;                                                    // 0x0028(0x000C) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Damage;                                                    // 0x0034(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageMin;                                                 // 0x0038(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DamageFalloff;                                             // 0x003C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      DamageType;                                                // 0x0040(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      OriginatingWeapon;                                         // 0x0048(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Radius;                                                    // 0x0050(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              RadiusInner;                                               // 0x0054(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExplosionPenetrationSettings*               PenetrationSettings;                                       // 0x0058(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                      CameraShakeClass;                                          // 0x0060(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CameraShakeRadius;                                         // 0x0068(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              CameraShakeFalloff;                                        // 0x006C(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ShellShockRadius;                                          // 0x0070(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ShellShockDuration;                                        // 0x0074(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ExplosionForce;                                            // 0x0078(0x0004) (BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MG21[0x4];                                     // 0x007C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ScopeConfiguration
// 0x0034
struct FScopeConfiguration
{
	float                                              FOV;                                                       // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FOVLowQualityFraction;                                     // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EOpticZoomLevel                                    ZoomLevelClassification;                                   // 0x0008(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_7EME[0x3];                                     // 0x0009(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              ZoomScopeModelReticleScale;                                // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ZoomScopeModelReticleScaleFireDelta;                       // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ZoomScopeModelRadialClipScale;                             // 0x0014(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ZoomScopeModelFocusScale;                                  // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ReticleMeshOffset;                                         // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              ZoomScopeReticleMeshOffset;                                // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bApplyZoomReticleMeshOffsetHQS;                            // 0x0024(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_N6W3[0x3];                                     // 0x0025(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       AlignmentSocket;                                           // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bTreatAsStandardOptic;                                     // 0x0030(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_K6WC[0x3];                                     // 0x0031(0x0003) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.MuzzleUpgradeWeaponProperties
// 0x0088
struct FMuzzleUpgradeWeaponProperties
{
	unsigned char                                      Weapon[0x28];                                              // 0x0000(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	class UAkAudioEvent*                               AkEventFire;                                               // 0x0028(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventFire1P;                                             // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventFire3P;                                             // 0x0038(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventTriggerPull;                                        // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventTriggerPull1P;                                      // 0x0048(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventTriggerPull3P;                                      // 0x0050(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventFireStart;                                          // 0x0058(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventFireStart1P;                                        // 0x0060(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventFireStart3P;                                        // 0x0068(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventFireEnd;                                            // 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventFireEnd1P;                                          // 0x0078(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                               AkEventFireEnd3P;                                          // 0x0080(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.AnimationAdditivePair
// 0x0010
struct FAnimationAdditivePair
{
	class UAnimSequence*                               Additive;                                                  // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               Base;                                                      // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.FirstPersonAnims
// 0x09F8
struct FFirstPersonAnims
{
	unsigned char                                      KitSelectAsset[0x28];                                      // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               KitSelect;                                                 // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         Activation;                                                // 0x0030(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         Melee;                                                     // 0x0060(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         MeleeBash;                                                 // 0x0090(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         MeleeFlinch;                                               // 0x00C0(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         Flinch;                                                    // 0x00F0(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      SightsDeltaAsset[0x28];                                    // 0x0120(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               SightsDelta;                                               // 0x0148(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      PointSightsDeltaAsset[0x28];                               // 0x0150(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               PointSightsDelta;                                          // 0x0178(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnderbarrelDeltaAsset[0x28];                               // 0x0180(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               UnderbarrelDelta;                                          // 0x01A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      DeployedDeltaAsset[0x28];                                  // 0x01B0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               DeployedDelta;                                             // 0x01D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnderbarrelIdleAsset[0x28];                                // 0x01E0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               UnderbarrelIdle;                                           // 0x0208(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      StockIdleAsset[0x28];                                      // 0x0210(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               StockIdle;                                                 // 0x0238(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      IdleAsset[0x28];                                           // 0x0240(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Idle;                                                      // 0x0268(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      IdleEmptyAsset[0x28];                                      // 0x0270(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               IdleEmpty;                                                 // 0x0298(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      IdleExplicitEmptyAsset[0x28];                              // 0x02A0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               IdleExplicitEmpty;                                         // 0x02C8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      IdleDeployedAsset[0x28];                                   // 0x02D0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               IdleDeployed;                                              // 0x02F8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     Origin;                                                    // 0x0300(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     OriginIron;                                                // 0x030C(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      BreathingAsset[0x28];                                      // 0x0318(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Breathing;                                                 // 0x0340(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         IdleSpecial;                                               // 0x0348(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FAnimSequenceRandom                         IdleSpecialIron;                                           // 0x0378(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UBlendSpace*                                 Movement;                                                  // 0x03A8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                                 MovementIron;                                              // 0x03B0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               ExplicitReady;                                             // 0x03B8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BQ26[0x7];                                     // 0x03B9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FAnimSequenceRandom                         Ready;                                                     // 0x03C0(0x0030) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	unsigned char                                      BlockedAsset[0x28];                                        // 0x03F0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Blocked;                                                   // 0x0418(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      BlockedIronAsset[0x28];                                    // 0x0420(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               BlockedIron;                                               // 0x0448(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseCommonDraw;                                             // 0x0450(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W714[0x7];                                     // 0x0451(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      DrawAsset[0x28];                                           // 0x0458(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Draw;                                                      // 0x0480(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseCommonHolster;                                          // 0x0488(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8SS5[0x7];                                     // 0x0489(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      HolsterAsset[0x28];                                        // 0x0490(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Holster;                                                   // 0x04B8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseCommonDown;                                             // 0x04C0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5GSL[0x7];                                     // 0x04C1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      DownAsset[0x28];                                           // 0x04C8(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Down;                                                      // 0x04F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseCommonSprint;                                           // 0x04F8(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5M3Q[0x3];                                     // 0x04F9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     CommonSprintAdjustment;                                    // 0x04FC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      CommonSprintPoseAsset[0x28];                               // 0x0508(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               CommonSprintPose;                                          // 0x0530(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SprintTransitionInAsset[0x28];                             // 0x0538(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               SprintTransitionIn;                                        // 0x0560(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SprintTransitionOutAsset[0x28];                            // 0x0568(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               SprintTransitionOut;                                       // 0x0590(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                                 Sprint;                                                    // 0x0598(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EIKDirection                                       IKSprint;                                                  // 0x05A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseCommonSprintHardcore;                                   // 0x05A1(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FZVE[0x6];                                     // 0x05A2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      SprintHardcoreTransitionInAsset[0x28];                     // 0x05A8(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               SprintHardcoreTransitionIn;                                // 0x05D0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SprintHardcoreTransitionOutAsset[0x28];                    // 0x05D8(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               SprintHardcoreTransitionOut;                               // 0x0600(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                                 SprintHardcore;                                            // 0x0608(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EIKDirection                                       IKSprintHardcore;                                          // 0x0610(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseCommonCrawl;                                            // 0x0611(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_P5GQ[0x2];                                     // 0x0612(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     CommonCrawlAdjustment;                                     // 0x0614(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      CommonCrawlPoseAsset[0x28];                                // 0x0620(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               CommonCrawlPose;                                           // 0x0648(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                                 Crawl;                                                     // 0x0650(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBlendSpace*                                 DeployedCrawl;                                             // 0x0658(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EIKDirection                                       IKCrawl;                                                   // 0x0660(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_OAB8[0x7];                                     // 0x0661(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UBlendSpace*                                 Swimming;                                                  // 0x0668(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ChargeAsset[0x28];                                         // 0x0670(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Charge;                                                    // 0x0698(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      KickDoorAsset[0x28];                                       // 0x06A0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               KickDoor;                                                  // 0x06C8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimationAdditivePair                      Scavenge;                                                  // 0x06D0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimationAdditivePair                      ResupplyCrate;                                             // 0x06E0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FAnimationAdditivePair                      ResupplyCrateMagazine;                                     // 0x06F0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      DoorAsset[0x28];                                           // 0x0700(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Door;                                                      // 0x0728(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SlideStartAsset[0x28];                                     // 0x0730(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               SlideStart;                                                // 0x0758(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SlideLoopAsset[0x28];                                      // 0x0760(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               SlideLoop;                                                 // 0x0788(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SlideEndAsset[0x28];                                       // 0x0790(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               SlideEnd;                                                  // 0x07B8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      VaultStartAsset[0x28];                                     // 0x07C0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               VaultStart;                                                // 0x07E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      VaultLoopAsset[0x28];                                      // 0x07F0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               VaultLoop;                                                 // 0x0818(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      VaultEndAsset[0x28];                                       // 0x0820(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               VaultEnd;                                                  // 0x0848(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      JumpStartAsset[0x28];                                      // 0x0850(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               JumpStart;                                                 // 0x0878(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      JumpIdleAsset[0x28];                                       // 0x0880(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               JumpIdle;                                                  // 0x08A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      JumpEndAsset[0x28];                                        // 0x08B0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               JumpEnd;                                                   // 0x08D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      LeapAsset[0x28];                                           // 0x08E0(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Leap;                                                      // 0x0908(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      ProneTransitionAsset[0x28];                                // 0x0910(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               ProneTransition;                                           // 0x0938(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnequippedAsset[0x28];                                     // 0x0940(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Unequipped;                                                // 0x0968(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      TossAsset[0x28];                                           // 0x0970(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	class UAnimSequence*                               Toss;                                                      // 0x0998(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EIKDirection                                       IKMaster;                                                  // 0x09A0(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_VPJ7[0x7];                                     // 0x09A1(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TMap<class UClass*, struct FAnimSequenceRandom>    AlternateReady;                                            // 0x09A8(0x0050) (Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.MountWeaponConfig
// 0x1800
struct FMountWeaponConfig
{
	struct FFirstPersonAnims                           FirstPersonAnims;                                          // 0x0000(0x09F8) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FFirearmAnimsGroup                          FirstPersonFirearmAnims;                                   // 0x09F8(0x0DE0) (Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonOverrideCommonDraw;                            // 0x17D8(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonCommonDraw;                                    // 0x17D9(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonOverrideCommonHolster;                         // 0x17DA(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonCommonHolster;                                 // 0x17DB(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonOverrideCommonDown;                            // 0x17DC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonCommonDown;                                    // 0x17DD(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonOverrideCommonSprint;                          // 0x17DE(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonCommonSprint;                                  // 0x17DF(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     FirstPersonCommonSprintAdjustment;                         // 0x17E0(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonOverrideCommonCrawl;                           // 0x17EC(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFirstPersonCommonCrawl;                                   // 0x17ED(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_RHB6[0x2];                                     // 0x17EE(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     FirstPersonCommonCrawlAdjustment;                          // 0x17F0(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_AIVU[0x4];                                     // 0x17FC(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.MountCompatibleWeaponInfo
// 0x00A0
struct FMountCompatibleWeaponInfo
{
	unsigned char                                      WeaponConfigs[0x50];                                       // 0x0000(0x0050) UNKNOWN PROPERTY: MapProperty
	unsigned char                                      Upgrades[0x50];                                            // 0x0050(0x0050) UNKNOWN PROPERTY: SetProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WeaponAnimInstanceProxy
// 0x0010 (0x06F0 - 0x06E0)
struct FWeaponAnimInstanceProxy : public FAnimInstanceProxy
{
	unsigned char                                      UnknownData_MHQL[0x10];                                    // 0x06E0(0x0010) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.PlayerVoteIntention
// 0x0018
struct FPlayerVoteIntention
{
	unsigned char                                      IntentPlayers[0x10];                                       // 0x0000(0x0010) UNKNOWN PROPERTY: ArrayProperty
	float                                              LastVote;                                                  // 0x0010(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5KL0[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.CastVote
// 0x0030
struct FCastVote
{
	unsigned char                                      PlayerState[0x28];                                         // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	int                                                Choice;                                                    // 0x0028(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_S6L8[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.TalkerData
// 0x0028
struct FTalkerData
{
	unsigned char                                      UnknownData_LKIY[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UVoiceComponent*                             RadioComponent;                                            // 0x0008(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVoiceComponent*                             ProximityComponent;                                        // 0x0010(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_L1IM[0x10];                                    // 0x0018(0x0010) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ScreenResolution
// 0x0008
struct FScreenResolution
{
	int                                                Width;                                                     // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Height;                                                    // 0x0004(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.HoveringVehicleTargetMemory
// 0x0020
struct FHoveringVehicleTargetMemory
{
	class AActor*                                      TargetActor;                                               // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LastSeenTimestamp;                                         // 0x0008(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     LastSeenLocation;                                          // 0x000C(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHasLOS;                                                   // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_FZAM[0x7];                                     // 0x0019(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.HoveringVehicleWeaponBehavior
// 0x0060
struct FHoveringVehicleWeaponBehavior
{
	class UClass*                                      FirearmClass;                                              // 0x0000(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              AttackRadius;                                              // 0x0008(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MinAttackAngle;                                            // 0x000C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseBurst;                                                 // 0x0010(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_EHCA[0x3];                                     // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              MinBurstTime;                                              // 0x0014(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              MaxBurstTime;                                              // 0x0018(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              BurstCooldown;                                             // 0x001C(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseWeaponOffsetFromActor;                                 // 0x0020(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_KZJJ[0x3];                                     // 0x0021(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              LocationLeadSpeed;                                         // 0x0024(0x0004) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAdjustShotAfterFiring;                                    // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_911G[0x3];                                     // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     PerShotOffset;                                             // 0x002C(0x000C) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int8_t                                             ShotAdjustmentThreshold;                                   // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WKR4[0x1F];                                    // 0x0039(0x001F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TWeakObjectPtr<class AItemFirearm>                 WeaponInstance;                                            // 0x0058(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.HelicopterMoveRequest
// 0x0020
struct FHelicopterMoveRequest
{
	struct FVector                                     FlyDestination;                                            // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     OriginalFlyDestination;                                    // 0x000C(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bFlyAroundDestination;                                     // 0x0018(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CT66[0x3];                                     // 0x0019(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              FlyAroundRadius;                                           // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.SeatAnimationStruct
// 0x0120
struct FSeatAnimationStruct
{
	class UAnimSequence*                               NormalIdle;                                                // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                        NormalAO;                                                  // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVehicleIdleSpecialSequence>         SpecialIdle;                                               // 0x0010(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               VehicleMovementLayer;                                      // 0x0020(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               Duck;                                                      // 0x0028(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               DuckIdle;                                                  // 0x0030(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               Death;                                                     // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               IronIdle;                                                  // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequence*>                       IronIdleSpecial;                                           // 0x0048(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               RelaxedIdle;                                               // 0x0058(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequence*>                       RelaxedIdleSpecial;                                        // 0x0060(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                        RelaxedAO;                                                 // 0x0070(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               MeleeIdle;                                                 // 0x0078(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                        MeleeAO;                                                   // 0x0080(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               WindowIn;                                                  // 0x0088(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               WindowOut;                                                 // 0x0090(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               WindowIdle;                                                // 0x0098(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               WindowAO;                                                  // 0x00A0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               DriverIdle;                                                // 0x00A8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequence*>                       DriverIdleSpecial;                                         // 0x00B0(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                        DriverAO;                                                  // 0x00C0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               DriverDuck;                                                // 0x00C8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               DriverDuckIdle;                                            // 0x00D0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               DriverDeath;                                               // 0x00D8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               GearShift;                                                 // 0x00E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               GasPedal;                                                  // 0x00E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               WheelTurn;                                                 // 0x00F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               WheelTurnDucking;                                          // 0x00F8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace1D*                      WeightShiftHorizontal;                                     // 0x0100(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace1D*                      WeightShiftVertical;                                       // 0x0108(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                        TurretAO;                                                  // 0x0110(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                               Fire;                                                      // 0x0118(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.VehicleIdleSpecialSequence
// 0x0018
struct FVehicleIdleSpecialSequence
{
	class UAnimSequence*                               Idle;                                                      // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAimOffsetBlendSpace*                        AO;                                                        // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EIKSpecialScenario                                 IKType;                                                    // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DRIZ[0x7];                                     // 0x0011(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.UsableActor
// 0x009C
struct FUsableActor
{
	TWeakObjectPtr<class AActor>                       Actor;                                                     // 0x0000(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                                  HitResult;                                                 // 0x0008(0x0088) (BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EUsablePriority                                    Priority;                                                  // 0x0090(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_HF4Y[0x3];                                     // 0x0091(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Distance;                                                  // 0x0094(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              DotProduct;                                                // 0x0098(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.TheaterSquadLayout
// 0x0010
struct FTheaterSquadLayout
{
	class USquadLayout*                                SquadLayout;                                               // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USquadLayout*                                BotSquadLayout;                                            // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.TheaterFaction
// 0x0088
struct FTheaterFaction
{
	unsigned char                                      FactionDefinition[0x28];                                   // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	struct FTheaterSquadLayout                         DefaultSquadLayout;                                        // 0x0028(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      GamemodeSquadLayouts[0x50];                                // 0x0038(0x0050) UNKNOWN PROPERTY: MapProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.DecalInfo
// 0x0038
struct FDecalInfo
{
	TArray<class UMaterialInterface*>                  Materials;                                                 // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     MinSize;                                                   // 0x0010(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     MaxSize;                                                   // 0x001C(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              LifeSpan;                                                  // 0x0028(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FadeOutDelay;                                              // 0x002C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FadeOutDuration;                                           // 0x0030(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bNeedSpreadTime;                                           // 0x0034(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_CE1M[0x3];                                     // 0x0035(0x0003) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.SurfaceReactionInfo
// 0x0050
struct FSurfaceReactionInfo
{
	TEnumAsByte<EPhysicalSurface>                      SurfaceType;                                               // 0x0000(0x0001) (ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_2QM3[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UParticleSystem*>                     Effects;                                                   // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDecalInfo                                  Decal;                                                     // 0x0018(0x0038) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WWiseData
// 0x0058
struct FWWiseData
{
	TArray<struct FString>                             RTPCNames;                                                 // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                      RTPCValues;                                                // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int>                                        RTPCTimes;                                                 // 0x0020(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             SwitchNames;                                               // 0x0030(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FString>                             SwitchValues;                                              // 0x0040(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bDelayEvent;                                               // 0x0050(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_V96O[0x7];                                     // 0x0051(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.SurfaceReactionData
// 0x00B0
struct FSurfaceReactionData
{
	class UObject*                                     WorldContextObject;                                        // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWWiseData                                  WWiseData;                                                 // 0x0008(0x0058) (NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                         HitComponent;                                              // 0x0060(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FName                                       HitBoneName;                                               // 0x0068(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                           HitMaterial;                                               // 0x0070(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     HitDirection;                                              // 0x0078(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TEnumAsByte<EPhysicalSurface>                      SurfaceType;                                               // 0x0084(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_9SVM[0x3];                                     // 0x0085(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     Location;                                                  // 0x0088(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    Rotation;                                                  // 0x0094(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	unsigned char                                      DecalTransformMask;                                        // 0x00A0(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_POY1[0x3];                                     // 0x00A1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              Opacity;                                                   // 0x00A4(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               UseFootprintDecalPool;                                     // 0x00A8(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bWantsAudio;                                               // 0x00A9(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bVisibleBulletDecalForType;                                // 0x00AA(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_IKBZ[0x5];                                     // 0x00AB(0x0005) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.SurfaceReactionOutput
// 0x0018
struct FSurfaceReactionOutput
{
	TWeakObjectPtr<class UParticleSystemComponent>     ParticleSystem;                                            // 0x0000(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UDecalComponent>              Decal;                                                     // 0x0008(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UINSAudioComponent>           Audio;                                                     // 0x0010(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ManagedParticleComponent
// 0x0018
struct FManagedParticleComponent
{
	unsigned char                                      UnknownData_V6ZB[0x10];                                    // 0x0000(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UParticleSystemComponent*                    Component;                                                 // 0x0010(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.PreviewElement
// 0x0040
struct FPreviewElement
{
	struct FVector                                     Location;                                                  // 0x0000(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_OF8I[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FQuat                                       Orientation;                                               // 0x0010(0x0010) (IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     Extent;                                                    // 0x0020(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_H0O3[0x4];                                     // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UStructureElement*                           Element;                                                   // 0x0030(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                Floor;                                                     // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZIC9[0x4];                                     // 0x003C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsScenario
// 0x0028
struct FStatisticsScenario
{
	struct FString                                     Map;                                                       // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Mode;                                                      // 0x0010(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           GameType;                                                  // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_71S2[0x4];                                     // 0x0024(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsPlayerClass
// 0x0010
struct FStatisticsPlayerClass
{
	struct FString                                     Name;                                                      // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsWeapon
// 0x0010
struct FStatisticsWeapon
{
	struct FString                                     Name;                                                      // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsKillEvent
// 0x0028
struct FStatisticsKillEvent
{
	TArray<struct FStatisticsKillEventPlayer>          EventPlayers;                                              // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStatisticsPlayerKillFlags                         KillFlags;                                                 // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStatisticsPlayerSightFlags                        SightFlags;                                                // 0x0011(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BDNO[0x2];                                     // 0x0012(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              GameTime;                                                  // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     DamageCauser;                                              // 0x0018(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsKillEventPlayer
// 0x0028
struct FStatisticsKillEventPlayer
{
	uint64_t                                           StatsPlayerId;                                             // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     PlayerPosition;                                            // 0x0008(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    PlayerRotation;                                            // 0x0014(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EStatisticsPlayerStanceFlags                       StanceFlags;                                               // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStatisticsKillEventPlayerRole                     PlayerRole;                                                // 0x0021(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YFU8[0x6];                                     // 0x0022(0x0006) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsObjectiveEvent
// 0x0020
struct FStatisticsObjectiveEvent
{
	TArray<struct FStatisticsObjectiveEventPlayer>     EventPlayers;                                              // 0x0000(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              GameTime;                                                  // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                ObjectiveId;                                               // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                PriorOwningTeam;                                           // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                NewOwningTeam;                                             // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsObjectiveEventPlayer
// 0x0028
struct FStatisticsObjectiveEventPlayer
{
	uint64_t                                           StatsPlayerId;                                             // 0x0000(0x0008) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     PlayerPosition;                                            // 0x0008(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                                    PlayerRotation;                                            // 0x0014(0x000C) (ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EStatisticsPlayerStanceFlags                       StanceFlags;                                               // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_J0HR[0x7];                                     // 0x0021(0x0007) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsPlayerStatsBase
// 0x01D0
struct FStatisticsPlayerStatsBase
{
	uint32_t                                           Stats[0x55];                                               // 0x0000(0x0154) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FloatStats[0x1F];                                          // 0x0154(0x007C) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsPlayerStatClass
// 0x0050 (0x0220 - 0x01D0)
struct FStatisticsPlayerStatClass : public FStatisticsPlayerStatsBase
{
	TMap<struct FString, struct FStatisticsPlayerStatWeapon> PlayerWeapons;                                             // 0x01D0(0x0050) (NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsWeaponStatsBase
// 0x00D8
struct FStatisticsWeaponStatsBase
{
	uint32_t                                           Stats[0x21];                                               // 0x0000(0x0084) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              FloatStats[0x15];                                          // 0x0084(0x0054) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsPlayerStatWeapon
// 0x0000 (0x00D8 - 0x00D8)
struct FStatisticsPlayerStatWeapon : public FStatisticsWeaponStatsBase
{

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsPlayerExperienceResult
// 0x0048
struct FStatisticsPlayerExperienceResult
{
	uint32_t                                           PlayerId;                                                  // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_6LVB[0x4];                                     // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FString                                     UniqueId;                                                  // 0x0008(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           BaseExperienceGained;                                      // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           BonusExperienceGained;                                     // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           PreviousExperience;                                        // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           NewExperience;                                             // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           PreviousScore;                                             // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           NewScore;                                                  // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           PreviousBalance;                                           // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32_t                                           NewBalance;                                                // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint32_t>                                   ItemsGained;                                               // 0x0038(0x0010) (ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StatisticsRoundSummaryResult
// 0x0030
struct FStatisticsRoundSummaryResult
{
	unsigned char                                      UnknownData_CVVX[0x30];                                    // 0x0000(0x0030) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StationPhrase
// 0x0028
struct FStationPhrase
{
	EStationResponse                                   AssociatedResponse;                                        // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_5YJR[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAkAudioEvent*                               Event;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       SubtitleText;                                              // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StationFireSupportStatusPhraseContainer
// 0x0018
struct FStationFireSupportStatusPhraseContainer
{
	class UFireSupportDefinition*                      AssociatedFireSupport;                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStationFireSupportStatusPhrase>     StatusPhrases;                                             // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.StationFireSupportStatusPhrase
// 0x0028
struct FStationFireSupportStatusPhrase
{
	EStationResponse                                   AssociatedResponse;                                        // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0I5V[0x7];                                     // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UAkAudioEvent*                               Event;                                                     // 0x0008(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FText                                       SubtitleText;                                              // 0x0010(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.EmitterRegister
// 0x0010
struct FEmitterRegister
{
	unsigned char                                      UnknownData_P7JQ[0x10];                                    // 0x0000(0x0010) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.SmoothTransition
// 0x0060
struct FSmoothTransition
{
	unsigned char                                      UnknownData_PDPT[0x8];                                     // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FRotator                                    RotationStart;                                             // 0x0008(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                                    RotationGoal;                                              // 0x0014(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                     LocationStart;                                             // 0x0020(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                     LocationGoal;                                              // 0x002C(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              WorldTimeStart;                                            // 0x0038(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              WorldTimeGoal;                                             // 0x003C(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHasRotationTransition;                                    // 0x0040(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHasLocationTransition;                                    // 0x0041(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_8SL8[0x2];                                     // 0x0042(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FVector                                     RotationPivot;                                             // 0x0044(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                                 Curve;                                                     // 0x0050(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bIncludeRotationalOffset;                                  // 0x0058(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bEndTransition;                                            // 0x0059(0x0001) (ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_GU14[0x6];                                     // 0x005A(0x0006) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.VaultSmoothTransition
// 0x0010 (0x0070 - 0x0060)
struct FVaultSmoothTransition : public FSmoothTransition
{
	float                                              TimeMultiplier;                                            // 0x0060(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	unsigned char                                      UnknownData_RDRQ[0x4];                                     // 0x0064(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UCurveVector*                                VCurve;                                                    // 0x0068(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.CustomGameConfig
// 0x0010
struct FCustomGameConfig
{
	float                                              PreRoundTimeOverride;                                      // 0x0000(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_JG4L[0x4];                                     // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UPlayerClass*                                DefaultPlayerClassOverride;                                // 0x0008(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ObjectiveInfoMissions
// 0x0018
struct FObjectiveInfoMissions
{
	struct FString                                     ObjectiveName;                                             // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int                                                TimeExtension;                                             // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_TNFB[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ObjectiveInfo
// 0x0038
struct FObjectiveInfo
{
	unsigned char                                      Objective[0x28];                                           // 0x0000(0x0028) UNKNOWN PROPERTY: SoftObjectProperty
	unsigned char                                      SpawnZones[0x10];                                          // 0x0028(0x0010) UNKNOWN PROPERTY: ArrayProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ObjectiveGroup
// 0x0020
struct FObjectiveGroup
{
	unsigned char                                      Objectives[0x10];                                          // 0x0000(0x0010) UNKNOWN PROPERTY: ArrayProperty
	unsigned char                                      SpawnZones[0x10];                                          // 0x0010(0x0010) UNKNOWN PROPERTY: ArrayProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.AdditionalScenarioActors
// 0x0050
struct FAdditionalScenarioActors
{
	class UClass*                                      Actor;                                                     // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FString                                     Name;                                                      // 0x0008(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_YGTJ[0x8];                                     // 0x0018(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FTransform                                  Location;                                                  // 0x0020(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ScenarioSublevel
// 0x0020
struct FScenarioSublevel
{
	struct FName                                       Name;                                                      // 0x0000(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bLoadOnServer;                                             // 0x0008(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bLoadOnClient;                                             // 0x0009(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseWithSpecifiedGameModesOnly;                            // 0x000A(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_988K[0x5];                                     // 0x000B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned char                                      SpecifiedGameModes[0x10];                                  // 0x0010(0x0010) UNKNOWN PROPERTY: ArrayProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.PlayerClassAttributes
// 0x0034
struct FPlayerClassAttributes
{
	bool                                               bOverridePlayerSpeed;                                      // 0x0000(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_W6RT[0x3];                                     // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              SpeedMultiplier;                                           // 0x0004(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SprintMultiplier;                                          // 0x0008(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              SlideMultiplier;                                           // 0x000C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bPlayerSpeedOverrideRelative;                              // 0x0010(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bHardcoreMovementAnimations;                               // 0x0011(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bOverrideHealth;                                           // 0x0012(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_DINV[0x1];                                     // 0x0013(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	int                                                Health;                                                    // 0x0014(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              HeadshotDamageScale;                                       // 0x0018(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bOverridePlayerScale;                                      // 0x001C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_WDEW[0x3];                                     // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              PlayerScale;                                               // 0x0020(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              HeadScale;                                                 // 0x0024(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bOverridePlayerGravity;                                    // 0x0028(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_0PS3[0x3];                                     // 0x0029(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              GravityScale;                                              // 0x002C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAllowJumpShoot;                                           // 0x0030(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAllowJumpAim;                                             // 0x0031(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAllowFreeaim;                                             // 0x0032(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bAllowAimDownSights;                                       // 0x0033(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.RulesetGameModeRulesMinimal
// 0x00B8
struct FRulesetGameModeRulesMinimal
{
	TArray<struct FRulesetProperty>                    Rules;                                                     // 0x0000(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bUseAttributeOverrides;                                    // 0x0010(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_ZCW9[0x3];                                     // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FPlayerClassAttributes                      AttributeOverrides;                                        // 0x0014(0x0034) (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	class UTheaterDefinition*                          OverrideTheaterDefinition;                                 // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USquadLayout*                                AllFactionsSquadLayoutOverride;                            // 0x0050(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      SquadLayoutOverride[0x50];                                 // 0x0058(0x0050) UNKNOWN PROPERTY: MapProperty
	TArray<struct FFireSupportGameModeOverride>        FireSupportOverrides;                                      // 0x00A8(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.RulesetGameModeRules
// 0x00F8 (0x01B0 - 0x00B8)
struct FRulesetGameModeRules : public FRulesetGameModeRulesMinimal
{
	unsigned char                                      HUD[0x28];                                                 // 0x00B8(0x0028) UNKNOWN PROPERTY: SoftClassProperty
	struct FText                                       OverridenGameModeName;                                     // 0x00E0(0x0018) (Edit, NativeAccessSpecifierPublic)
	TArray<struct FText>                               OverridenGameModeRules;                                    // 0x00F8(0x0010) (Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USquadLayout*                                AllFactionsBotSquadLayoutOverride;                         // 0x0108(0x0008) (Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      BotSquadLayoutOverride[0x50];                              // 0x0110(0x0050) UNKNOWN PROPERTY: MapProperty
	unsigned char                                      CounterAttackOverride[0x50];                               // 0x0160(0x0050) UNKNOWN PROPERTY: MapProperty

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WeaponUpgradeFilterPair
// 0x0010
struct FWeaponUpgradeFilterPair
{
	class UWeaponUpgradeFilterTest*                    Test;                                                      // 0x0000(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFilterType                                        FilterType;                                                // 0x0008(0x0001) ELEMENT_SIZE_MISMATCH  (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_BUDA[0x3];                                     // 0x0009(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	unsigned char                                      UnknownData_G4FC[0x4];                                     // 0x000C(0x0004) MISSED OFFSET (PADDING)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.WeaponCrateWeaponPool
// 0x00A0
struct FWeaponCrateWeaponPool
{
	struct FString                                     PoolName;                                                  // 0x0000(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                              Chance;                                                    // 0x0010(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_MAZF[0x4];                                     // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UPlayerEquipmentCollection*>          PlayerEquipmentCollections;                                // 0x0018(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      Weapons[0x10];                                             // 0x0028(0x0010) UNKNOWN PROPERTY: ArrayProperty
	unsigned char                                      PotentialUpgrades[0x10];                                   // 0x0038(0x0010) UNKNOWN PROPERTY: ArrayProperty
	bool                                               bOverrideUpgradePool;                                      // 0x0048(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                               bOverrideUpgradeChance;                                    // 0x0049(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	unsigned char                                      UnknownData_K6JV[0x2];                                     // 0x004A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              UnspecifiedSlotUpgradeChance;                              // 0x004C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EWeaponUpgradeSlot, float>                    SpecificSlotUpgradeChance;                                 // 0x0050(0x0050) (Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

	void AfterRead();
	void BeforeDelete();

};

// ScriptStruct Insurgency.ManagedRagdoll
// 0x0010
struct FManagedRagdoll
{
